[
  {
    "id": "1",
    "startTime": "2025-07-05 22:27:24",
    "completionTime": "2025-07-05 22:27:49",
    "imageUrl": "/—Pngtree—global data security personal data_1752646.jpg",

    "projectTitleAr": "تأمين النظم الحساسة بإستخدام منهجيات الذكاء الاصطناعي",
    "projectTitleEn": "Securing sensitive systems using artificial intelligence methodologies",
    "supervisorAr": "مروه احمد شومان",
    "supervisorEn": "Marwa Ahmed Shouman",
    "teamMembers": "ماهر جمعه اسماعيل سيد(قائد الفريق , مصمم نظام التأمين , مدرب موديل الذكاء الاصطناعي ) -علياء نبيل علي مصطفى ( مصممة الواجهة ) - فاطمه ايهاب عبدلله كامل ( مصمة الواجهة)",
    "descriptionAr": "مشروع نظام الأمان SecSys يُعد حلاً أمنيًا متكاملاً مخصصاً للمنظمات الحساسة، يقدم مراقبة فورية وكشف ذكي للتهديدات مع واجهة تحكم ميسرة. يعتمد على تقنيات متطورة تشمل Flask للنظام الخلفي، وHTML/CSS/JavaScript للواجهة الأمامية، وTensorFlow وOpenCV لتحليل الصور والصوت، مع دعم ميزات مثل كشف العواطف واكتشاف الانحرافات الصوتية. يشمل النظام إشعاراً لعربات الشرطة وقسم الشرطة، وحساب أقرب المسارات لجميع العربات مع مراعاة الازدحام المروري، بالإضافة إلى نظام تشفير متقدم للبيانات الحساسة تم تطويره بتقنيات مبتكرة من قبل فريق المشروع.",
    "descriptionEn": "The SecSys Security System is a comprehensive security solution designed for sensitive organizations, offering real-time monitoring, intelligent threat detection, and an intuitive control interface. It leverages advanced technologies, including Flask for the backend, HTML/CSS/JavaScript for the frontend, and TensorFlow and OpenCV for image and audio analysis, with features such as emotion detection and anomaly sound identification. The system includes notifications to police vehicles and stations, calculates the nearest routes for all vehicles considering traffic congestion, and incorporates a proprietary encryption system for sensitive data, developed innovatively by the project team.",
    "technologies": "Python Flask HTML CSS JavaScript TensorFlow OpenCV SQLAlchemy Docker",
    "category": "security",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B692FEA22-935F-478A-8CB9-B3C0DEE51F40%7D&file=SecSys_%D9%85%D8%A7%D9%87%D8%B1%20%D8%AC%D9%85%D8%B9%D9%87%20%D8%A7%D8%B3%D9%85%D8%A7%D8%B9%D9%8A%D9%84%20%D8%B3%D9%8A.docx&action=default&mobileredirect=true"
  },
  {
    "id": "2",
    "startTime": "7/5/2025  10:34:26 PM",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "نظام ذكي لتقليل استهلاك الطاقة والصيانة التنبؤية باستخدام الذكاء الاصطناعي",
    "projectTitleEn": "Power Consumption Optimization and Predictive Maintenance Smart System",
    "supervisorAr": "د. مروة شومان",
    "supervisorEn": "Dr. Marwa Shouman",
    "teamMembers": "معاذ أنور سليمان - قائد الفريق ومسؤول عن الهارد ويير وربط جميع أجزاء المشروع ببعضه.\\ ناريمان امام- مسؤولة عن تطبيق الجورزمات الذكاء الاصطناعي\\ مريم رمضان- مسؤولة عن تحليل البيانات وتجميعها\\ إبراهيم عبد المنعم - مسؤول عن نشر المشروع وتصميم هيكل المشروع\\ منة لله محمد - مسؤولة عن الأبليكيشن.",
    "descriptionAr": "يهدف هذا المشروع إلى تصميم وتنفيذ نظام ذكي يعتمد على تقنيات الذكاء الاصطناعي من أجل تقليل استهلاك الطاقة في المصانع وتحسين جدولة الصيانة من خلال التنبؤ بالأعطال قبل وقوعها.",
    "descriptionEn": "This project aims to design and implement an intelligent system based on Artificial Intelligence techniques to reduce energy consumption in industrial environments and optimize maintenance schedules by predicting potential failures before they occur.",
    "technologies": "Python,Scikit-learn,Pandas & NumPy,FastAPI,Flask ,SQLite ,Flutter ,Dart ,Docker ,Git & GitHub,Raspberry Pi 4,Draw.io,Markdown",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BF7FCD0E8-C2DA-4795-AD20-FADA9E48A7DB%7D&file=Project%20Info_%D9%85%D8%B9%D8%A7%D8%B0%20%D8%A7%D9%86%D9%88%D8%B1%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%B9%D9%84%D9%89%20%D8%B3.docx&action=default&mobileredirect=true"
  },
  {
    "id": "3",
    "startTime": "7/5/2025  11:17:07 PM",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "معالجك: منصة المساعدة الصحية الذكية ",
    "projectTitleEn": "Power Consumption Optimization and Predictive Maintenance Smart System",
    "supervisorAr": "د مها طلبه",
    "supervisorEn": "Dr. Maha Tolba",
    "teamMembers": "رحمة صلاح الدين عمر حمودة - تطوير الـ backend وبناء الـ system architecture، سلمي محمود عبد العظيم - تطوير الـ backend وعمل الـ database، رقيه احمد شبل - تطوير الـ frontend ودمج الـ API، هدير رجب فرج - تطوير الـ frontend",
    "descriptionAr": "ثيرابيا (Therapia) هو تطبيق ويب شامل وذكي للمساعدة الصحية، صُمم لتعزيز التواصل والتنسيق بين المرضى والمتخصصين في الرعاية الصحية مثل الأطباء، وأخصائيي التغذية، ومدربي اللياقة البدنية. يتيح هذا النظام للمرضى الاشتراك مع واحد أو أكثر من المتخصصين وفقًا لاحتياجاتهم، وتقديم تقارير يومية عن صحتهم أو نظامهم الغذائي أو تمارينهم الرياضية من خلال واجهة بسيطة وسهلة الاستخدام. يتم تخصيص لوحة تحكم خاصة لكل دور من الأدوار (المريض، المتخصص، والمسؤول الإداري)، مع ميزات مناسبة لمسؤوليات كل منهم. يمكن للمتخصصين مراجعة تقارير المرضى، وتقديم الملاحظات، وتتبع تقدم المرضى مع مرور الوقت. كما يوفّر النظام خاصية الرسائل الآمنة والفورية لدعم الرعاية المستمرة. ولضمان قابلية التوسع والإدارة الفعالة، يتضمن نظام ثيرابيا لوحة تحكم إدارية لإدارة اشتراكات المتخصصين، والمدفوعات، وإعدادات النظام العامة. كما تتيح باقات الاشتراك للمتخصصين اختيار عدد المرضى الذين يمكنهم دعمهم، مما يخلق نموذج تسعير مرنًا وعادلاً. تم بناء النظام باستخدام ASP.NET Core للواجهة الخلفية، وSQL Server لإدارة قاعدة البيانات، وAngular لتنسيق الواجهة الأمامية. ومن خلال التركيز على البنية المعمارية المعيارية، وأمن البيانات، والتحكم في الوصول بناءً على الدور الوظيفي، يهدف ثيرابيا إلى تقديم تجربة موثوقة وسهلة الاستخدام واحترافية لإدارة الرعاية الصحية الرقمية. كما يلبّي الطلب المتزايد على حلول الرعاية الصحية عن بُعد، ويساهم في التحول الرقمي المستمر في قطاعي الطب والصحة العامة.",
    "descriptionEn": "Therapia is a comprehensive and intelligent health assistance web application designed to enhance communication and coordination between patients and healthcare professionals such as doctors, nutritionists, and fitness trainers. The platform enables patients to subscribe to one or more professionals based on their needs and submit daily health, diet, or exercise reports through a simple and intuitive interface. Each user role—patient, professional, and administrator—is provided with a dedicated dashboard that offers features tailored to their responsibilities. Professionals can review patient reports, offer feedback, and track patient progress over time. The platform also facilitates secure, realtime messaging to support continuous care. To ensure scalability and efficient management, Therapia incorporates an admin panel that manages professional subscriptions, payments, and systemwide settings. Subscription packages allow professionals to choose the number of patients they can support, creating a flexible and fair pricing model. The system was built using ASP.NET Core for the backend, SQL Server for database management, and Angular for frontend styling. Emphasizing modular architecture, data security, and rolebased access control, Therapia aims to provide a reliable, userfriendly, and professional digital healthcare management experience. It addresses the growing demand for remote healthcare solutions and contributes to the ongoing digital transformation in the medical and wellness sectors.",
    "technologies": "ASP.NET Core Web API Angular Framework Integration between ASP.NET Core and Angular / REST API Git / git hub hosting",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BBD006105-CEB0-435E-91EF-F06CA154D58C%7D&file=rahma%20project_RAHMA%20SALAHALDEEN.docx&action=default&mobileredirect=true"
  },
  {
    "id": "4",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "نظام التعرف على لغة الإشارة العربية",
    "projectTitleEn": "Arabic Sign Language Recognition System",
    "supervisorAr": "د /احمد مصطفي عبد الحميد المحلاوي",
    "supervisorEn": "Dr. Ahmed Mostafa Abdelhamid El-Mahlawy",
    "teamMembers": "عبدالرحمن مجدي عبدالعزيز – تصميم نموذج الذكاء الاصطناعي والتدريب / إسلام إيهاب محمد إسلام – إعداد قاعدة البيانات وتحليل المعطيات / إسلام عبدالبصير عبدالعظيم عبدالحكم – تنفيذ التطبيق على أجهزة الموبايل باستخدام Dart / وليد محمد محمد ريحان – تنفيذ وتصميم واجهة المستخدم باستخدام Flutter",
    "descriptionAr": "يهدف المشروع إلى تطوير نظام ذكي للتعرف على لغة الإشارة العربية من خلال استخدام الكاميرا فقط. يعتمد النظام على MediaPipe لاستخراج معالم اليد في الوقت الفعلي، ثم يستخدم نموذج شبكات عصبية مصمم خصيصًا لتصنيف الإشارات الثابتة بدقة عالية. يهدف المشروع إلى تسهيل التواصل بين مجتمع الصم وباقي المجتمع باستخدام تقنيات الذكاء الاصطناعي ومعالجة الصور.",
    "descriptionEn": "The project aims to develop a real-time Arabic Sign Language recognition system using only a camera. It leverages MediaPipe to extract hand landmarks and feeds them into a neural network classifier for accurate recognition of static signs. The system is designed to facilitate communication between the deaf community and the hearing population using AI and computer vision technologies.",
    "technologies": "Python,Scikit-learn,Pandas & NumPy,FastAPI,Flask ,SQLite ,Flutter ,Dart ,Docker ,Git & GitHub,Raspberry Pi 4,Draw.io,Markdown",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B6AC480EB-65E5-4CA3-9028-FA31F42E8EBE%7D&file=Cover%20Page%20(2)_AbdAlrahaman%20MAGDY.docx&action=default&mobileredirect=true"
  },
  {
    "id": "5",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "الخدمات المصغرة والحوسبة السحابية",
    "projectTitleEn": "Microservices And Cloud Computing ",
    "supervisorAr": "أ.د / نرمين البهنساوي",
    "supervisorEn": "Prof. Dr. Nirmeen A. El-Bahnasawy ",
    "teamMembers": "مصطفى ابراهيم محمد غيته - عمل تصميم للبنية السحابية وتيرافورم وانسيبل / مصطفى محمد عبد العظيم القصاص - عمل تصميم للبنية السحابية وتيرافورم وانسيبل / محمد مجدى توفيق الريفي - دوكر / محمد محمد عبد الباسط أبو المجد - كوبرنيتس / محمود محمد عبد العاطى أبو حلوة - هيلم / عمرو أشرف عبد الواحد خضر - جينكينز / محمد معتز محمد عبدالله - عمل نظام لمراقبة أداء السيستم",
    "descriptionAr": "هو منصة تجارة إلكترونية حديثة تم تطويرها باستخدام معمارية الخدمات المصغّرة، ويهدف إلى توفير بيئة قابلة للتوسّع وسهلة الصيانة وتدعم التشغيل الآلي، من خلال دمج أحدث تقنيات ديف أوبس والحوسبة السحابية.\n\nتم استخدام أداة لتحزيم وتشغيل الخدمات داخل حاويات برمجية لضمان تشغيلها بشكل موحّد على مختلف الأجهزة والأنظمة. كما تم استخدام نظام تنسيق متقدم لإدارة هذه الحاويات وتشغيلها على مستوى واسع. كذلك، استخدمنا أداة لإدارة حزم الخدمات وتسهيل نشرها وتحديثها بسهولة.\n\nتم بناء البنية التحتية السحابية باستخدام أداة تتيح إنشاء الموارد على شكل ملفات قابلة للتنفيذ، مما يوفّر الوقت ويقلل من الأخطاء. وتم استخدام أداة أخرى لأتمتة إعداد الخوادم وتثبيت البرمجيات اللازمة على البيئة السحابية.\n\nنُشر المشروع على منصة الحوسبة السحابية العالمية التي تتيح إنشاء وتشغيل البنية التحتية والتطبيقات بشكل آمن ومرن، مع الاستفادة من خدمات مثل الخوادم السحابية، وموازنات التحميل، وجدران الحماية الذكية.\n\nتم إعداد خط سير متكامل لدمج الكود واختباره وتسليمه بشكل تلقائي باستخدام أداة مفتوحة المصدر، مما يساعد في تسريع عملية تطوير ونشر التحديثات. كما تم استخدام أدوات مراقبة وتنبيه لمتابعة حالة النظام واكتشاف الأعطال وتحليل الأداء بشكل لحظي.\n\nيعكس هذا المشروع تطبيقاً عملياً شاملاً لمبادئ ديف أوبس، ويقدّم نموذجاً احترافياً لبناء تطبيقات سحابية حديثة تدعم التوسّع والتكرار الآمن والتشغيل التلقائي.",
    "descriptionEn": "Cloud-native e-commerce platform built using a microservices architecture. It integrates a wide range of DevOps and cloud technologies to ensure scalability, maintainability, and automation.\nThe system is fully containerized using Docker and orchestrated with Kubernetes, utilizing Helm for efficient deployment and management. Infrastructure is provisioned via Terraform (IaC) and configured using Ansible. The platform is deployed on AWS, benefiting from services like EC2, Load Balancer, and WAF. CI/CD pipelines are implemented using Jenkins, and system observability is achieved with Prometheus and Grafana.\nThis project demonstrates the practical application of DevOps principles and cloud technologies in delivering a robust, scalable, and automated production-grade web application.",
    "technologies": "Docker , Kubernetes, AWS ,Terraform, Ansible , Jenkins , Prometheus & Grafana ",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BFEE8D98C-3ACB-4BDD-8D58-69BB9606449B%7D&file=project_MOUSTAFA%20IBRAHIEM.docx&action=default&mobileredirect=true"
  },
  {
    "id": "6",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/net.png",

    "projectTitleAr": "تنفيذ بنية أمن الشبكات المتقدمة",
    "projectTitleEn": "Advanced Network Security Architecture Implementation",
    "supervisorAr": "دكتور/ مها طلبة",
    "supervisorEn": "Dr. / Maha Tolba",
    "teamMembers": "محمود أحمد عثمان – تكوين البنية التحتية للشبكة، تنفيذ الكتاب، تنفيذ العرض التقديمي / محمد حمدى محمد – عمل السيرفرات وتأمين الشبكة باستخدام الجدار الناري، مراجعة الكتاب، مراجعة العرض التقديمي",
    "descriptionAr": "يهدف هذا المشروع إلى تصميم وتنفيذ بنية تحتية آمنة ومتقدمة لشبكة شركة مركزية تعمل كمزود خدمات لشركات فرعية أخرى. يتضمن المشروع إنشاء شبكة متكاملة تعتمد على تقنيات حديثة في أمن المعلومات، مع تطبيق سياسات الحماية والتحكم في الوصول، وبناء شبكات فرعية مستقلة (VLANs) لكل شركة فرعية لضمان العزل والأمان. كما يشمل المشروع إعداد خوادم أساسية مثل (Web Server، AD، DHCP، DNS) وتكوين جدار ناري (Firewall)، وتنفيذ حلول VPN للوصول الآمن عن بُعد، بالإضافة إلى تطبيق سياسات فلترة الويب والحماية من الهجمات الإلكترونية (IPS، DoS) باستخدام أجهزة FortiGate. يُعد هذا المشروع محاكاة واقعية لطريقة بناء وتشغيل وتأمين شبكة مؤسسية حديثة قابلة للتوسع، مع مراعاة أفضل ممارسات أمن الشبكات.",
    "descriptionEn": "This project aims to design and implement an advanced and secure network infrastructure for a central company that acts as a service provider for multiple branch companies. The project involves building a fully integrated network using modern cybersecurity technologies, applying access control policies, and creating separate VLANs for each branch to ensure isolation and security. It includes the setup of essential servers such as DNS, DHCP, Active Directory, and a Web Server. The security framework is implemented using FortiGate firewalls, with firewall policies, VPN solutions for secure remote access, and the application of web filtering and protection against cyberattacks (IPS, DoS). This project serves as a practical simulation of how to build, operate, and secure a scalable enterprise network while following best practices in network security.",
    "technologies": "GNS3 VMware Workstation Windows Server (2019) Linux OS FortiGate VM Windows 10 Kali",
    "category": "networks",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BE2E0207D-59EF-4754-B5DF-2B57DFAF659A%7D&file=Cover%20Page_MAHMOUD%20AHMED.docx&action=default&mobileredirect=true"
  },
  {
    "id": "7",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "كير كونيكت ايجيبت( تقديم خدمات طبية )",
    "projectTitleEn": "CareConnect Egypt",
    "supervisorAr": "د . الحسيني ابراهيم خطاب",
    "supervisorEn": "Dr . Alhossainy Ebrahim khattab",
    "teamMembers": "عبدالرحمن ربيع يحيى فرحات – Full Stack باستخدام .NET، أحمد سعيد عبدالغفار شلبي – Full Stack باستخدام .NET، إسلام محمد كامل محمود – Full Stack باستخدام .NET، سيف الدين عاطف عبدالعظيم – مهندس بنية سحابية (Cloud Architect)، عبدالرحمن أحمد سعد شندي صيام – تطبيق الهاتف باستخدام Flutter",
    "descriptionAr": "توفر المنصة خدمات صحية شاملة تجمع بين العيادات الحكومية (بما في ذلك عيادات التأمين الصحي) والعيادات الخاصة التي تضم نخبة من أكفأ الأطباء في مختلف التخصصات الطبية. وتهدف المنصة إلى تقليل الازدحام وتيسير الوصول إلى الرعاية الصحية من خلال نظام إلكتروني متطور يتيح حجز المواعيد والكشف الطبي عن بُعد، مما يضمن تجربة صحية آمنة وسلسة للمستخدمين. كما تقدم المنصة مجموعة من المزايا الإضافية المبتكرة، من بينها: مساعد ذكي (ChatBot) للرد الفوري على الاستفسارات الطبية والإرشادية، حاسبة مؤشر كتلة الجسم (BMI Calculator) لمتابعة الحالة الصحية، ودليل الإسعافات الأولية لتوفير المعلومات الضرورية في حالات الطوارئ.",
    "descriptionEn": "The platform offers integrated healthcare services, combining both public clinics (including health insurance clinics) and private clinics, featuring a team of highly skilled doctors across various specialties. The platform aims to reduce congestion and facilitate access to healthcare through an advanced online booking system and remote medical consultations, ensuring a seamless and secure experience for users. Additionally, the platform provides a range of innovative extra features, including: a Smart Assistant (ChatBot) for instant responses to medical and general inquiries, a BMI Calculator to monitor health status, and a First Aid Guide for providing essential information in emergency situations.",
    "technologies": "ASP.NET Core MVC , mobile app using flutter",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/graduation_project_%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D8%B1%D8%AD%D9%85%D9%86%20%D8%B1%D8%A8%D9%8A%D8%B9%20%D9%8A%D8%AD%D9%8A%D9%8A.pdf"
  },
  {
    "id": "8",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "نظام شئون الموظفين",
    "projectTitleEn": "Employee Affair's System",
    "supervisorAr": "د /جمال سليم",
    "supervisorEn": "Dr Gamal Selim",
    "teamMembers": "حسين عبدالمقصود السيد الشتلة – Back-End Developer، أحمد مجدي سيد أحمد – Back-End Developer، مروة عماد عبدالحميد محمود – Back-End Developer، مصطفى أحمد إبراهيم هنداوي – Front-End Developer",
    "descriptionAr": "تطبيق ويب شامل لإدارة الموارد البشرية والمهام الإدارية المتعلقة بالموظفين في جامعة المنوفية. صُمم لتسهيل التعامل مع سجلات الموظفين، والهيكل التنظيمي، والبدلات المالية، والوظائف، والشهادات، والحالات الصحية، وغيرها الكثير.",
    "descriptionEn": "A comprehensive web-based application developed in ASP.NET Core for managing human resources and employee-related administrative tasks for the employees of Menofia University. It is designed to facilitate seamless handling of employee records, organizational structure, financial allowances, job positions, certificates, health statuses, and much more.",
    "technologies": "Framework: ASP.NET Core 8.0 Web API - Language: C# - ORM: Entity Framework Core - Database: SQL Server - Tools: Swagger or Postman for API testing - CI/CD: GitHub Actions, Azure DevOps",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BCE72A0F8-7ED0-4679-B6F8-66D10116735F%7D&file=Employee%20Form_%D8%AD%D8%B3%D9%8A%D9%86%20%D8%B9%D8%A8%D8%AF%20%D8%A7%D9%84%D9%85%D9%82%D8%B5%D9%88%D8%AF%20%D8%A7%D9%84%D8%B3.docx&action=default&mobileredirect=true"
  },
  {
    "id": "9",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/Screenshot 2025-07-09 101355.png",

    "projectTitleAr": "نظام الاتصال الداخلي الذكي",
    "projectTitleEn": "Smart intercom system",
    "supervisorAr": "د / الحسيني إبراهيم    د/ عبدالعزيز علي خاطر",
    "supervisorEn": "Dr / Elhossiney Ebrahiem   Dr/ Abdelaziz Ali Khater",
    "teamMembers": "هاجر محمد سعيد حمودة – Application Development، فاطمة محمود حاتم الكوراني – Application Development، عبدالله مصطفى الصاوي – مسؤول عن جزء الهاردوير والتوصيلات وجزء الذكاء الاصطناعي (AI)، أحمد محمد سليم – مسؤول عن جزء الهاردوير والتوصيلات، أحمد عبدالله السيسي – مسؤول عن Firebase والـBack-End، محمد السيد جمال الدين – مسؤول عن Firebase والـBack-End",
    "descriptionAr": "مشروع الإتصال الداخلي الذكي هو نظام أمان منزلي يهدف إلى تعزيز الحماية والتحكم في الدخول والمراقبة عن بُعد. يعتمد النظام على وحدة ESP32-CAM كوحدة تحكم رئيسية تقوم بالتقاط صور الزوار وإرسالها في الوقت الحقيقي إلى Firebase عند استشعار الحركة بواسطة حساس PIR. من خلال تطبيق الهاتف المحمول، يمكن للمستخدم مراجعة الوجوه الجديدة، والسماح للأشخاص الموثوق بهم، والتحكم في فتح الباب عن بُعد. إذا تم التعرف على وجه مطابق لأحد المصرح لهم، يتم فتح الباب تلقائيًا. كما يتم استخدام لوحة أردوينو إضافية للتحكم في أجزاء أخرى مثل القفل أو جرس الإنذار. يعكس هذا المشروع الاستخدام العملي لإنترنت الأشياء والرؤية الحاسوبية وربط الأنظمة بقواعد البيانات الحية في تطوير نظام ذكي وآمن للدخول المنزلي.",
    "descriptionEn": "The Smart Intercom System is a home security solution designed to enhance safety, access control, and remote monitoring. The system uses an ESP32-CAM as its main controller to capture and transmit real-time images of visitors. A PIR motion sensor detects movement near the entrance, triggering the camera to capture a photo which is uploaded to Firebase. Through a mobile application, users can review unknown faces, authorize trusted individuals, and control door access remotely. If a detected face matches an authorized one, the system automatically unlocks the door. An additional Arduino board may be used to control actuators such as door locks or alarms. This project demonstrates practical use of IoT, computer vision, and real-time database integration in creating a secure and intelligent intercom system.",
    "technologies": "ESP32-CAM, Arduino UNO, Firebase (Realtime Database & Cloud Storage), Face Recognition (OpenCV or cloud-based), PIR Sensor, Mobile App (Flutter)using visual code studio, IoT (Wi-Fi based communication)",
    "category": "embedded",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BA7F00A88-BE30-4AA0-9FD3-EBA210D7AF20%7D&file=smart%20intercom%20project_%D9%87%D8%A7%D8%AC%D8%B1%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%B3%D8%B9%D9%8A%D8%AF%20%D8%A7%D8%AD%D9%85%D8%AF.docx&action=default&mobileredirect=true"
  },
  {
    "id": "10",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "كير كونيكت ايجيب (تقديم خدمات طبية)",
    "projectTitleEn": "CareConnect Egypt",
    "supervisorAr": "د / الحسيني ابراهيم خطاب ",
    "supervisorEn": "Dr / Al-hossainy ebrahim khattab",
    "teamMembers": "عبدالرحمن ربيع يحيى فرحات – Full Stack using .NET، أحمد سعيد عبدالغفار شلبي – Full Stack using .NET، إسلام محمد كامل محمود – Full Stack using .NET، سيف الدين عاطف عبدالعظيم – Cloud Architect، عبدالرحمن أحمد سعد شندي صيام – Mobile App using Flutter",
    "descriptionAr": "تُقدم منصة CareConnect خدمات طبية متكاملة لجميع أفراد المجتمع، حيث تجمع بين العيادات الحكومية (بما في ذلك عيادات التأمين الصحي) والعيادات الخاصة التي تضم نخبة من أكفأ الأطباء في مختلف التخصصات. تهدف المنصة إلى تقليل الازدحام وتسهيل الوصول إلى الرعاية الصحية من خلال نظام حجز إلكتروني وكشف طبي عن بُعد، مما يضمن تجربة سلسة وآمنة للمستخدمين. كما توفر المنصة مزايا إضافية مبتكرة مثل: مساعد ذكي (ChatBot) للرد على الاستفسارات، حاسبة مؤشر كتلة الجسم (BMI Calculator)، ودليل الإسعافات الأولية.",
    "descriptionEn": "The platform provides comprehensive healthcare services that combine government clinics (including health insurance clinics) and private clinics featuring a selection of the most qualified doctors in various medical specialties. The platform aims to reduce congestion and facilitate access to healthcare through an advanced electronic system that allows for appointment booking and remote medical consultations, ensuring a safe and smooth healthcare experience for users. The platform also offers a range of new and innovative additional features, including a Smart Assistant (ChatBot) for instant responses to medical and general inquiries, a BMI Calculator to help users monitor their health status, and a First Aid Guide to provide essential information in emergency situations.",
    "technologies": "ASP.NET Core MVC , mobile app using flutter",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/GraduationProject_%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D8%B1%D8%AD%D9%85%D9%86%20%D8%B1%D8%A8%D9%8A%D8%B9%20%D9%8A%D8%AD%D9%8A%D9%8A.pdf"
  },
  {
    "id": "11",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/Screenshot 2025-07-09 101355.png",

    "projectTitleAr": "الكرسي المتحرك الذكي",
    "projectTitleEn": "Smart Wheelchair",
    "supervisorAr": "د/ الحسيني إبراهيم ",
    "supervisorEn": "Dr/ Elhossiny Ibrahim",
    "teamMembers": "Ahmed Ashraf- Website development, Mobile application design, Manual wheelchair control (buttons), Voice control, Mobile app control, EEG signals control (simulation), GPS Tracking System Implementation, Emergency System Ebraam Nabil - Implementing the majority of the mobile application, especially the wheelchair control section  Ahmed Hamdy - Manual wheelchair control (joystick), Motor connection and operation Arsany Gerges - Obstacle avoidance through programming ultrasonic sensors  Mina Samir - Health monitoring, Implementing the health monitoring section in the mobile app, Wheelchair design",
    "descriptionAr": "مشروعنا يهدف إلى تطوير الكراسي المتحركة لذوي الاحتياجات الخاصة. حيث يتم التحكم في الكرسي عن طريق عدة طرق منها: اليدوي (عن طريق عصا التحكم)، تطبيق الكرسي المتحرك الذكي، عن طريق ترجمة الأوامر الصوتية، وعن طريق ترجمة الإشارات العصبية. يحتوي الكرسي على مستشعرات لتجنب العوائق أثناء الحركة، بالإضافة إلى نظام مراقبة صحية لقياس النبض ونسبة الأكسجين في الدم. كما يتضمن زر طوارئ لإرسال تنبيه سريع في حالات الخطر. بالإضافة إلى موقع إلكتروني.",
    "descriptionEn": "Our project aims to develop advanced wheelchairs for people with special needs, where the wheelchair can be controlled using multiple methods, including: Manual control (via joystick), Smart Wheelchair Android application, Voice command translation, Neural signal interpretation. The wheelchair is equipped with sensors to avoid obstacles during movement, in addition to a health monitoring system to measure heart rate and blood oxygen levels. It also includes an emergency button to send quick alerts in dangerous situations. Website.",
    "technologies": "' Arduino Mega 2560  HC-05 Bluetooth Module  Flutter  Ultrasonic Sensors  Pulse & Heat Sensors   Voice Command Integration   Neural Signal Interface (e.g., EEG)  Serial Communication (UART)  Proteus for simulation",
    "category": "embedded",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B4B3AFFC4-C37E-4E3E-AD50-819143EA2676%7D&file=%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D9%85%D8%A7%D8%B1%D8%A9_AHMED%20HAMDY.docx&action=default&mobileredirect=true"
  },
  {
    "id": "12",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "لسان الضاد",
    "projectTitleEn": "Dhad's Tongue",
    "supervisorAr": "د/ مروة شومان",
    "supervisorEn": "Dr/ Marwa Shouman",
    "teamMembers": "منير طنطاوي (ادخال البيانات واعداد البيانات لتدريب نموذج الذكاء الاصطناعي وتقديم بيانات نظيفة) - حبيبة أبو خليل (كتابة الكود لبرمجة النظام علي تشكيل الكلمات) - كريم الدين أحمد (كتابة الكود لبرمجة النظام علي تشكيل الكلمات وتسجيل الصوت المستخدم في المشروع) - الاء أمين الجزيري",
    "descriptionAr": "يقوم المشروع باستقبال جملة اسمية بنمط يطابق احد الانماط التي يعمل عليها النظام باللغة العربية الفصحى وتكون غير مشكلة ويقوم النظام بتشكيل تلك الجملة ومن ثم نطق هذه الجملة صوتيا بعد عملية التشكيل اي انه مخرجات النظام عن الجملة التي ادخالها ولكن بعد التشكيل بالإضافة الى الصوت الخاص بنطق هذه الجملة.",
    "descriptionEn": "The project receives a nominal sentence with a pattern that matches one of the patterns that the system works on in the classical Arabic language and it is not vocalized. The system vocalizes that sentence and then pronounces this sentence aloud after the vocalization process. That is, it is the system’s output of the sentence that was entered, but after vocalization, in addition to the sound for pronouncing this sentence.",
    "technologies": "AI , Python, MongoDB, Data Structures",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BDB5976BB-AF88-49AC-BE34-AF4E082D3EA6%7D&file=Graduation%20Project%20brief_KAREEM%20Aldeen.docx&action=default&mobileredirect=true"
  },
  {
    "id": "13",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "ميدلينز: منصة رعاية صحية مدعومة بالذكاء الاصطناعي",
    "projectTitleEn": "MedLens: AI-Powered Healthcare Platform",
    "supervisorAr": "د/ مروة شرف الدين",
    "supervisorEn": "Dr. Marwa Sharaf Eldin",
    "teamMembers": "Ahmed Alahmady (Backend Developer) - Ahmed Alashmawy (Frontend Developer) - Karim Osama (AI Developer) - Ola Tarek (Frontend Developer) - Alzahraa El Sayed (Frontend Developer)",
    "descriptionAr": "يعاني قطاع الرعاية الصحية الحديث من مشكلة التجزئة، حيث تعمل الخدمات التشخيصية والعيادية والصيدلانية في وحدات منفصلة ومنعزلة. تؤدي هذه التجزئة إلى انخفاض الكفاءة، وتأخير في تقديم الرعاية، وتجربة غير مترابطة لكل من المرضى ومقدمي الخدمات. يهدف هذا المشروع، الذي يحمل اسم \"MedLens\"، إلى معالجة هذا التحدي الجوهري من خلال تصميم وتنفيذ منصة رعاية صحية متكاملة ومدعومة بالذكاء الاصطناعي. الهدف الأساسي هو إنشاء نظام بيئي رقمي موحد يربط بسلاسة بين المرضى والأطباء والصيدليات، مع دمج تقنيات الذكاء الاصطناعي المتقدمة لتقديم دعم تشخيصي فوري ودقيق.\n\nلتحقيق ذلك، تم اعتماد معمارية حديثة قائمة على الخدمات المصغرة (Microservices)، والتي تفصل النظام إلى ثلاثة مكونات أساسية: واجهة أمامية سريعة الاستجابة مبنية باستخدام React.js، وخدمة واجهة برمجة تطبيقات رئيسية قوية تم تطويرها باستخدام Node.js و Express.js، وخدمة استدلال للذكاء الاصطناعي عالية الأداء باستخدام Python و FastAPI. يتم تشغيل ذكاء المنصة بواسطة مجموعة من ثمانية نماذج تعلم عميق متخصصة، تم تطويرها باستخدام تقنيات التعلم بالنقل (Transfer Learning)، وهي قادرة على تحليل مجموعة واسعة من الصور الطبية - بما في ذلك فحوصات الدماغ والصدر والعين والجلد - بدقة عالية تتراوح بين 89% و 97%. تم بناء النظام على أساس آمن، يتضمن نظام توثيق قائم على JWT، ونظام تحكم في الوصول يعتمد على الأدوار (RBAC)، وممارسات آمنة للتعامل مع البيانات.\n\nكانت نتيجة هذا المشروع منصة متعددة الأدوار تعمل بكامل طاقتها. يتم تمكين المرضى من خلال أدوات لإدارة سجلاتهم الطبية، والحصول على تحليل فوري لفحوصاتهم مدعوم بالذكاء الاصطناعي، وحجز المواعيد بسلاسة مع الأطباء القريبين. يتم تزويد الأطباء بلوحة تحكم تعزز من خبراتهم، مما يسمح لهم بمراجعة الرؤى الناتجة عن الذكاء الاصطناعي، وإدارة المرضى، وتبسيط سير عملهم السريري. كما تم دمج الصيدليات في هذا النظام البيئي من خلال أدوات لإدارة مخزونهم، مما يجعل مدى توفر الأدوية شفافًا للمرضى.\n\nفي الختام، يوضح مشروع MedLens بنجاح جدوى وقيمة دمج التشخيصات المتقدمة القائمة على الذكاء الاصطناعي ضمن منصة شاملة لإدارة الرعاية الصحية. إنه يقدم حلاً قوياً لمشكلة تجزئة الرعاية الصحية، مما يخلق نموذجاً أكثر ترابطاً وكفاءة وذكاءً لتقديم الرعاية الصحية في المستقبل.",
    "descriptionEn": "The modern healthcare sector is often characterized by significant fragmentation, where diagnostic, clinical, and pharmaceutical services operate in disconnected silos. This fragmentation leads to inefficiencies, delays in care, and a disjointed experience for patients and providers alike. This project, titled MedLens, addresses this critical challenge by designing and implementing a comprehensive, AI-powered integrated healthcare platform. The primary objective is to create a unified digital ecosystem that seamlessly connects patients, doctors, and pharmacies, while embedding advanced artificial intelligence to provide immediate and accurate diagnostic support.\n\nTo achieve this, a modern microservices architecture was adopted, separating the system into three core components: a responsive frontend built with React.js, a robust main API service developed with Node.js and Express.js, and a high-performance AI inference service using Python and FastAPI. The platform's intelligence is driven by a suite of eight specialized deep learning models, developed using transfer learning techniques, which are capable of analyzing a wide range of medical images—including brain, chest, eye, and skin scans—with high accuracy (89-97%). The system is built upon a secure foundation, incorporating JWT-based authentication, role-based access control, and secure data handling practices.\n\nThe result of this project is a fully functional, multi-role platform. Patients are empowered with tools to manage their medical records, receive instant AI-driven analysis of their scans, and seamlessly book appointments with nearby doctors. Doctors are provided with a dashboard that augments their expertise, allowing them to review AI-generated insights, manage patients, and streamline their clinical workflow. Pharmacies are integrated into the ecosystem with tools to manage their inventory, making medication availability transparent to patients.\n\nIn conclusion, the MedLens project successfully demonstrates the feasibility and value of integrating advanced AI diagnostics within a comprehensive healthcare management platform. It presents a robust solution to the problem of healthcare fragmentation, creating a more connected, efficient, and intelligent model for future healthcare delivery.",
    "technologies": "Frontend: React.js, Backend (Main API): Node.js, Express.js, Backend (AI Service): Python, FastAPI, Database: MongoDB (with Mongoose ODM), Artificial Intelligence: Deep Learning, Transfer Learning (TensorFlow, PyTorch), Authentication: JSON Web Tokens (JWT), Architectural Style: Microservices, REST API",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Graduation%20Project%20-%20MedLens_AHMED%20hassan.pdf"
  },
  {
    "id": "14",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "معالجة امراض النبات باستخدام الذكاء الاصطناعي",
    "projectTitleEn": "Smart Agriculture ",
    "supervisorAr": "د/ الحسيني إبراهيم ",
    "supervisorEn": "Dr/ Elhossiny Ibrahim",
    "teamMembers": "فادي عطيه عبده توفيق (مسئول عن بناء الشات بوت باستخدام ال LLM) - فادي وديع ويليم سيدهم (مسئول عن بناء الموديل لاكتشاف امراض النباتات) - محمود محمد منصور (مسئول عن بناء server وربطه بالموبيل ابلكيشن) - مينا سامي نعيم (مسئول عن بناء قاعدة بيانات الشات وعمل deployment) - سيف سمير سيف شحاته (بناء الواجهات وعمل monitoring system) - مينا ياسر شكير شاكر (بناء الموبيل ابلكيشن والداتا الخاص بالسيرش عن امراض النبات)",
    "descriptionAr": "نقوم ببناء موبيل ابلكيشن قادر علي اكتشاف امراض النبات وعمل مراقبه ليها للحفاظ عليها. وتعزيز الوعي لمعرفه اي مرض وعلاجه قد يصيب النباتات.",
    "descriptionEn": "We are building a mobile application capable of detecting plant diseases and monitoring them to protect them, and raising awareness about any disease that may affect plants and its treatment.",
    "technologies": "AI (Computer Vision, Image Processing, NLP, LLMs) / Python / Dart / Flutter",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BC566F430-5E31-47AF-BA71-BAE6014D4448%7D&file=Cover%20Page_FADY%20ATTIA.docx&action=default&mobileredirect=true"
  },
  {
    "id": "15",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "توزيع المهام ",
    "projectTitleEn": "DistriTask",
    "supervisorAr": "دكتور: احمد مصطفى المحلاوي",
    "supervisorEn": "Dr./ Ahmed Moustafa Al-Mahalawy",
    "teamMembers": "Youssef Mustafa Mosaad Mohamed (Frontend) - Ahmed Hamdy Mahmoud Ramdan (Backend) - Emad Mohamed Saad Badr (Backend) - Mustafa Ali Mustafa Al-Marazy (DevOps and Cloud)",
    "descriptionAr": "تطبيق شامل لإدارة المهام، مُصمم باستخدام Django. يدعم هذا التطبيق نوعين من المستخدمين: المدير والموظف، مع ميزات متقدمة تشمل الدردشة الفورية، ودعم روبوت الدردشة بالذكاء الاصطناعي، ومصادقة API آمنة.",
    "descriptionEn": "A comprehensive backend implementation of the Task Manager project, built with Django. It supports two types of users: Manager and Employee, with advanced features including real-time chat, AI chatbot assistance, and secure API authentication.",
    "technologies": "Python 3.x, Django 4.x, Django REST Framework, Django Channels (WebSockets), Celery (Task Queue), Redis (Message Broker & Cache), MySQL or SQLite, Authentication (Django's built-in authentication, Token authentication for API access), pytest, Django test framework, HTML5, CSS3, JavaScript, Font Awesome (icon library), SweetAlert2 (Alert message library), GitHub, Docker, Kubernetes, Ansible, CI/CD, Monitoring, AWS",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B9990FF5A-584E-4230-A401-3A7546B6E890%7D&file=DistriTask_%D9%85%D8%B5%D8%B7%D9%81%D9%89%20%D8%B9%D9%84%D9%89%20%D9%85%D8%B5%D8%B7%D9%81%D9%89%20%D8%A7%D9%84%D9%85%D8%B1.docx&action=default&mobileredirect=true"
  },
  {
    "id": "16",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/Screenshot 2025-07-09 101355.png",

    "projectTitleAr": " نظام الري الذكي ",
    "projectTitleEn": "Smart Irrigation System",
    "supervisorAr": "د / مروة عباس رداد ",
    "supervisorEn": "Dr/ marwa Abbas El_Raddad",
    "teamMembers": "Ahmed Khaled Ahmed El-Nady (Embedded & mobile app) - Mohamed Zakaria Khidr (Embedded) - Mahmoud Salah Gomaa (Machine learning) - Youssef Safwat Hussein (BackEnd) - Niveen Hussein Ahmed (Mobile app) - Marwa Salah Mahmoud (BackEnd)",
    "descriptionAr": "نظام الري الذكي هو مشروع يستخدم التكنولوجيا لتحسين عملية ري النباتات بشكل تلقائي وفعّال. يهدف هذا النظام إلى توفير الماء والحفاظ على صحة النباتات من خلال تحديد الكميات المناسبة من الماء التي تحتاجها النباتات بناءً على الظروف البيئية.",
    "descriptionEn": "A smart irrigation system is a project that uses technology to automatically and efficiently improve plant watering. This system aims to conserve water and maintain plant health by determining the appropriate amounts of water plants need based on environmental conditions.",
    "technologies": "ATmega32, ESP8266 Wi-Fi Module, Soil Moisture Sensor, LM35 Temperature Sensor, DS18B20 Temperature Sensor, L293D Motor Driver, DC Water Pump, Embedded C, Flutter SDK, Dart Language, BLoC (Flutter State Management), Dio (HTTP Client), Laravel Framework, MySQL Database, Laravel Sanctum, Postman, Ngrok, Git & GitHub, Composer, Machine Learning (Python), StreamBuilder (Flutter), Intl Package (Flutter), VS Code, Android Studio",
    "category": "embedded",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BAC84800D-FA8B-46D8-95A9-925F1D1D380A%7D&file=smart_AHMED%20KHALED.docx&action=default&mobileredirect=true"
  },
  {
    "id": "17",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "تأجير سيارات",
    "projectTitleEn": "Car Rental",
    "supervisorAr": "د/ مها طلبة  ",
    "supervisorEn": "Dr/ Maha Tolba",
    "teamMembers": "FrontEnd - عمر سمير منصور الفقس - FrontEnd - عمر مختار محمد المغاورى حيدر - BackEnd - محمود رضا المتولى ابوالعزم - BackEnd - عبدالرحمن فتحى أحمد يوسف - Embedded Systems - يوسف عمر سعيد شاهين - Embedded Systems - صلاح الدين يونس الرفاعى - Back-End & Embedded Systems - عبدالرحمن عمرو محمد عزالرجال",
    "descriptionAr": "تم تصميم موقعنا الإلكتروني لتوفير اتصال بين الأفراد الذين يرغبون في استئجار سيارة وبين شركات تأجير السيارات. هذه المنصة المبتكرة تُحدث تحولا في عملية تأجير السيارات التقليدية من خلال تقديم حل بسيط وآمن وفعال وسهل الاستخدام. إن كنت مسافرا تحتاج إلى استئجار سريع أو شركة تود تحقيق أقصى استفادة من أسطولها، فإن منصتنا تضمن لك تجربة خالية من المتاعب للطرفين. إحدى الميزات البارزة هي سهولة عملية التسجيل. يمكن للمستخدمين التسجيل بسرعة عن طريق التحقق من هويتهم باستخدام صورة، مما يضمن الأمان والشفافية منذ البداية ويخلق الثقة بين المستأجرين وأصحاب السيارات. بمجرد التسجيل، يحصل المستخدمون على إمكانية الوصول إلى قاعدة بيانات في الوقت الفعلي تحتوي على السيارات المتاحة للإيجار. يستخدم التطبيق تقنية متقدمة تعتمد على الموقع لعرض أقرب السيارات التي تتناسب مع معايير المستخدم. الأمان هو أولوية قصوى، ومنصتنا تضمن راحة البال للطرفين. عند وصول المستخدم إلى السيارة، يتم التحقق من هويته مرة أخرى من خلال نظام كاميرا داخل السيارة. هذه الميزة توفر طبقة إضافية من الأمان، حيث تضمن أن الأشخاص المصرح لهم فقط هم من يمكنهم القيادة، مما يقلل من خطر سوء الاستخدام أو السرقة. بالإضافة إلى الأمان، نركز على جعل عملية الدفع بسيطة وسلسة قدر الإمكان ليكون سهل الاستخدام وآمنًا.",
    "descriptionEn": "Our website is designed to provide a connection between individuals renting a car and car rental companies. The platform transforms the traditional car rental process by offering a solution that is not only secure but also efficient and user-friendly. One of the standout features is the easy registration process. Users are able to sign up quickly by verifying their identity using a photo. This ensures both security and transparency, creating trust between renters and car owners. Once registered, users gain access to a real-time database of available cars for rent. The app utilizes advanced location-based technology to display the nearest vehicles that fit the user’s criteria. Security will be a top priority, and our project ensures peace of mind for both parties. Upon arriving at the vehicle, the user’s identity is further verified through an in-car camera system. This feature provides an additional layer of security, ensuring that only authorized users can drive the car, reducing the risk of misuse or theft. In addition to security, we focus on making the payment process as simple and streamlined as possible. The app handles all transactions directly, eliminating the need for cash or complicated payment processes. The payment system is designed to be user-friendly and secure.",
    "technologies": "Front-End: React, Tailwind CSS, JavaScript, Vite, Back-End: Node.js, Socket.IO, PostgreSQL, Clerk, Stripe, Cloudinary, Embedded Systems: Raspberry Pi, Python, face_recognition, OpenCV, WebSockets",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Car_Rental_Grad_Project_%D8%B9%D8%A8%D8%AF%20%D8%A7%D9%84%D8%B1%D8%AD%D9%85%D9%86%20%D8%B9%D9%85%D8%B1%D9%88%20%D9%85%D8%AD%D9%85%D8%AF.pdf"
  },
  {
    "id": "18",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",
    "projectTitleAr": "تطوير موقع خدمات الطلاب لجامعة المنوفية",
    "projectTitleEn": "Developing the student services website for Menoufia University",
    "supervisorAr": "د.جمال سليم - د.عبد الوهاب فوزي",
    "supervisorEn": "Dr. Gamal Selim - Dr. Abdel Wahab Fawzy",
    "teamMembers": "زياد ياسين عبد العزيز الناظر (Frontend) - أمير أيمن النجار (Frontend) - يوسف أحمد جابر بكير (Backend) - محمد رأفت محمود عليوه (Backend) - وفاء محمد سيد (Backend) - محمد السيد القصاص (Backend) - عماد الدين عادل محمود رزق (DevOps) - رقية العبيدي رزق رزق سالم (Testing) - مصطفى عصام الدين عبدالحليم عباس (Security)",
    "descriptionAr": "تطوير موقع خدمات الطلاب لجامعة المنوفية هو مشروع يهدف إلى إنشاء منصة رقمية متكاملة تسهّل على الطلاب الوصول إلى خدماتهم الجامعية بطريقة سهلة، سريعة، وآمنة. تم تصميم الموقع بواجهة حديثة تدعم اللغة العربية والإنجليزية، وتتكيف تلقائيًا مع مختلف أحجام الشاشات لضمان أفضل تجربة استخدام. كما يتميز الموقع بتكامل قوي مع قواعد البيانات والأنظمة الداخلية للجامعة، ما يتيح عرض المعلومات وتقديم الطلبات بشكل مباشر وفوري.",
    "descriptionEn": "The Student Services Website Development for Menoufia University is a project designed to create a comprehensive digital platform that enables students to access their academic services in a fast, simple, and secure manner. The platform features a modern user interface with full support for Arabic and English, and a responsive design that adapts to all screen sizes. It also integrates seamlessly with the university’s internal systems to provide real-time data access and request submission.",
    "technologies": "React.js (UI library), React Router DOM (Routing system), Zustand (State management), Framer Motion (Animation library), i18next (Language support), Axios (API requests), HTML5 (Markup language), CSS3 (Styling rules), JavaScript ES6+ (Scripting language), ASP.NET Core (Web framework), Entity Framework (ORM tool), SQL Server (Database engine), RESTful APIs (Data interface), JWT (Auth tokens), Git (Version control), Visual Studio Code (Frontend & Backend IDE)",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/student%20services%20website_ZYAD%20YASEEN.pdf"
  },
  {
    "id": "19",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/net.png",

    "projectTitleAr": "نفيذ وتأمين البنية التحتية للشبكة",
    "projectTitleEn": "Implementing and Securing Network Infrastructure",
    "supervisorAr": "د / مها طلبة ",
    "supervisorEn": "Dr/ Maha Tolba",
    "teamMembers": "Abdelrahman Eid Massaud Ahmed and Abdullah Mohamed Mohamed (Infrastructure) - Mohamed Farrag Ahmed and Haitham Abdelraheem Mohamed (Security and Firewall Devices) - Mohammed Tarek Mohammed Helmy Badr (Administration) - Islam Mahmoud Abbas Abdelkreem (ISE Server and Web Server)",
    "descriptionAr": "يهدف مشروعنا، 'تنفيذ وتأمين البنية التحتية للشبكة'، إلى وضع خطة شاملة لإنشاء بيئة شبكة موثوقة وآمنة مصممة خصيصًا لتلبية الاحتياجات المحددة لمنظمتنا.",
    "descriptionEn": "Our project, 'Implementing and Securing Network Infrastructure,' aims to develop a comprehensive plan for establishing a reliable and secure network environment tailored to meet the specific needs of our organization.",
    "technologies": "Firewall, Cisco routers and switches, Penetlab, VirtualBox",
    "category": "networks",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B4074C18B-1ECE-4675-8553-5F56F8FACB18%7D&file=Grad-Word_AbdAlrahaman%20EID.docx&action=default&mobileredirect=true"
  },
  {
    "id": "20",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "موقع تجاري لقطع غيار السيارات",
    "projectTitleEn": "Car parts E-Commerce Platform",
    "supervisorAr": "د/ اثار علي",
    "supervisorEn": "Dr/ Athar Ali",
    "teamMembers": "Backend أحمد البراء علي خطاب - Frontend محمد حامد عبدالستار علي - UI/UX محمد شعبان عبدالكريم",
    "descriptionAr": "موقع إلكتروني متخصص في بيع قطع غيار السيارات، حيث يمكن للمستخدمين تصفح المنتجات بحسب النوع أو الماركة، والاطلاع على المواصفات والصور، ثم طلبها بسهولة عبر الإنترنت.",
    "descriptionEn": "A Scalable and Production ready web-based e-commerce platform that allows users to browse, search, and purchase car parts online. The platform supports multiple categories such as tires, batteries, and oils, includes features like product filtering, image galleries, and detailed specifications. It is built using modern web technologies including Node.js, Angular, Express, MongoDB, Figma and Docker for Development, with a focus on scalability and performance.",
    "technologies": "Angular, Bootstrap, NodeJs, MongoDB, Jest, Figma, Docker",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Project-Proposal_%D8%A7%D8%AD%D9%85%D8%AF%20%D8%A7%D9%84%D8%A8%D8%B1%D8%A7%D8%A1%20%D8%B9%D9%84%D9%89%20%D8%AE%D8%B7%D8%A7%D8%A8.pdf"
  },
  {
    "id": "21",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "محرك العاب تريفيام علي اجهزة الهاتف المحمول",
    "projectTitleEn": "game engine with visual programming interface on mobile phones 'Trivium'",
    "supervisorAr": "د/ اثار علي عين شوكة",
    "supervisorEn": "Dr. / Athar Ali",
    "teamMembers": "عبدالله ايهاب وجيه عبدالعاطي - ECS design, game engine design, node system design - اياد سامح الاعصر - UI implementation, Animation system - عبدالله السيد محمود الغندور - UI design, physics system implementation - سيف منتصر عبدالجواد - backend, login system - محمد ربيع محمد عبدالكريم - saving games, importing games feature",
    "descriptionAr": "محرك ألعاب للهواتف المحمولة تم تطويره باستخدام Flutter، يتيح للمطورين إنشاء ألعاب تعمل على مختلف أجهزة Android وiOS. يتميز بواجهة برمجة مرئية تعتمد على العقد (Nodes)، ويحتوي على محرك فيزيائي، ونظام لعناصر واجهة المستخدم (UI)، ومحرر للرسوم المتحركة (Animation Editor)، والعديد من المزايا الأخرى.",
    "descriptionEn": "A mobile game engine built with Flutter that allows developers to create games compatible with both Android and iOS devices. It features a visual programming interface based on nodes, a built-in physics engine, a UI element system, an animation editor, and many other powerful tools to streamline game development.",
    "technologies": "Dart, Flutter, MVVM, Provider, Firebase, Supabase, TensorFlow Lite",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Cover%20Page%20(1)_AbdAllah%20EHAB.pdf"
  },
  {
    "id": "22",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": "اللياقة الاساسية",
    "projectTitleEn": "Core Fit",
    "supervisorAr": "د/ اثار علي عين شوكه",
    "supervisorEn": "Dr / Athar Ali Einshoka",
    "teamMembers": "Ahmed Miska : Flutter - Mounir Ahmed : Front-end & Control Section - Ahmed Elnashar & Abdelrahman Hussien : AI - Abdelrahman Osama & Ahmed Elsayed : Back-end",
    "descriptionAr": "مشروعنا هو نظام متكامل لحجز الملاعب الرياضية وشراء المنتجات الرياضية، يشمل تطبيق ويب وتطبيق موبايل لسهولة الوصول والخدمة. يدعم المشروع الذكاء الاصطناعي من خلال شات بوت رياضي، ونظام توصية لخطط التغذية والتمارين، بالإضافة إلى ميزة التعرف على وجوه لاعبي كرة القدم.",
    "descriptionEn": "Develop a platform that combines e-commerce, sports field booking, and health monitoring using AI. Address the needs of users in managing sports activities and purchases easily and efficiently.",
    "technologies": "Front End: React.js, React Query, Axios, Auth, Leaflet Map, React Hook Form | Control: Arduino, ESP8266, Keypad, LCD 16x2, Micro Servo Motor | Mobile Development: Flutter, Dart | AI: LangChain, Groq API, FastAPI, JSON-based Chat Memory, Python, Scikit-learn (Decision Tree), Pandas, StandardScaler, NLP, Computer Vision | Back End: Java 17, Spring Boot, Spring Security, Spring Data JPA, Hibernate, MySQL, Redis, JWT, Cloudinary, Firebase, Lombok, Maven, Postman, SMTP  (Titan), Multipart Upload",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BE61CB05A-CECB-4764-8DED-CB57A491EF04%7D&file=core_fit_AHMED%20AbdAlfatah.docx&action=default&mobileredirect=true"
  },
  {
    "id": "23",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "البوابه الاكترونيه لجامعة المنوفيه ",
    "projectTitleEn": "Menoufia University  Main Portal ",
    "supervisorAr": "دكتور جمال سليم",
    "supervisorEn": "Dr Gamal Selim",
    "teamMembers": "Due to the large number of team members and their diverse roles, we have listed all names and their assigned parts in detail in the attached PDF file.",
    "descriptionAr": "هي منصة إلكترونية تهدف إلى تسهيل وإدارة مجموعة من المهام الإدارية والخدمية بشكل فعّال. توفر البوابة واجهة سهلة الاستخدام وآمنة للمستخدمين للتفاعل مع النظام، والاستفادة من الخدمات، وإدارة البيانات ذات الصلة بكل سهولة.",
    "descriptionEn": "The project we worked on is the MNF Portal, a web-based platform designed to streamline and manage various administrative and user-related tasks efficiently. It provides an interface for users to interact with the system, access services, and manage relevant data through a secure and user-friendly environment.",
    "technologies": ".NET - React - and others used in testing and web security and UI/UX, etc. All these technologies are detailed in the attached PDF.",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/GP%20Team_%D8%A7%D8%AD%D9%85%D8%AF%20%D8%B5%D8%A7%D9%84%D8%AD%20%D8%AB%D8%A7%D8%A8%D8%AA%20%D8%AC%D8%A7%D8%AF%20%D8%A7.pdf"
  },
  {
    "id": "24",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/net.png",

    "projectTitleAr": "تصميم وتنفيذ نظام شبكة للشركة الآمنة",
    "projectTitleEn": "Design and Implementation of a secure company network system",
    "supervisorAr": "د/ مها طلبة  ",
    "supervisorEn": "Dr/ Maha Tolba",
    "teamMembers": "Ayman Sabry: FortiGate Firewall Implementation, Aya Ali: Primary Branch Implementation, Shimaa Saeed: Secondary Branch Implementation, Marwa: Remote Site and DMZ Implementation",
    "descriptionAr": "يركز المشروع على تأمين شبكات الحاسوب من التهديدات الداخلية والخارجية والوصول غير المصرح به. يقدم المشروع تصميمًا آمنًا وقابلًا للتطوير لشبكة منظمة ذات فرعين (رئيسي وثانوي)، وشبكة منزوعة السلاح (DMZ) وشبكة وصول عن بُعد.",
    "descriptionEn": "The project focuses on securing computer networks from internal and external threats and unauthorized access. It provides a secure and scalable design for an organization’s network with two branches (primary and secondary), a demilitarized zone (DMZ), and a remote access network.",
    "technologies": "Virtual Machine, FortiGate Firewall, Servers, Core & Access Switches, Router",
    "category": "networks",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Screenshot%20(293)_AYMAN%20SABRY.png"
  },
  {
    "id": "25",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/—Pngtree—global data security personal data_1752646.jpg",

    "projectTitleAr": "تطوير البرمجيات الخبيثة",
    "projectTitleEn": "Malware Development",
    "supervisorAr": "د. مروة شرف الدين",
    "supervisorEn": "Dr. Marwa Sharaf Eldein",
    "teamMembers": "محمد محمود محمد على المليجى: المشروع كاملا",
    "descriptionAr": "يتناول هذا المشروع تقنيات مختلفة في تطوير البرمجيات الخبيثة المستخدمة لتجاوز أنظمة الحماية وتحقيق تنفيذ الشيفرات داخل بيئة نظام التشغيل ويندوز. يشمل المشروع تصميم وتنفيذ واختبار طرق مثل حقن الشيل كود، وحقن ملفات DLL، وتقنية تفريغ العمليات وتقنيات ربط واجهات API، وتشويش الحمولة باستخدام التشفير. يهدف المشروع إلى فهم كيفية عمل البرمجيات الخبيثة، ومحاكاة سيناريوهات هجوم واقعية في بيئة آمنة، مع التركيز على كشف نقاط الضعف لدعم أبحاث الدفاع السيبراني والتعليم.",
    "descriptionEn": "This project explores various malware development techniques used to evade detection and achieve code execution within Windows environments. It covers the design, implementation, and testing of methods such as shellcode injection, DLL injection, process hollowing, API hooking, and encryption-based payload obfuscation. The objective is to understand the inner workings of malware, simulate real-world attack scenarios in a controlled environment, and highlight potential security weaknesses to support defensive research and learning.",
    "technologies": "VirtualBox, VMware, Docker, Python, C/C++, Assembly, PowerShell, Windows API, VirusTotal API, PyInstaller, Nuitka, Flask, Microsoft Visual Studio (MSVC)",
    "category": "security",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BBA077C89-ADA8-4970-BFD4-21DE2FD32257%7D&file=Project_Form_%D9%85%D8%AD%D9%85%D8%AF%20%D9%85%D8%AD%D9%85%D9%88%D8%AF%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%B9%D9%84%D9%8A.docx&action=default&mobileredirect=true"
  },
  {
    "id": "26",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",
    "projectTitleAr": "نظام إدارة مستشفى ",
    "projectTitleEn": " Hospital management system",
    "supervisorAr": "د. مها طلبة ",
    "supervisorEn": "Dr : Maha Tolba",
    "teamMembers": "إسلام محمود محمود محمد أبوالركب: DevOps, أسامة ممدوح إبراهيم عمر: Front End, إسراء سعيد سمير محمد محمد: Front End, محمد حسام الدين الحنفي محروس: Back End, أحمد ياسر محمد مرة: Back End, أحمد مصطفى أحمد قنصوة: AI, أحمد إبراهيم عبدالحفيظ محمد: AI",
    "descriptionAr": "هو موقع ويب لمساعدة المستشفى على الاعتناء بصحة المرضى الموجودين مسبقاً على قاعدة بيانات المستشفى ومتابعة سجلهم المرضي وتقديم نصائح طبية لهم وتوجيههم في حالة ملاحظة أي خطر صحي عن طريق ترشيح دكاترة متخصصة وتحاليل لضمان سلامتهم. ومساعدة مستخدمي الموقع من الاطمئنان على أنفسهم في حالة ملاحظة أي أعراض غريبة من خلال تشخيص بعض الأمراض الأكثر شيوعاً وخطراً باستخدام الذكاء الاصطناعي.",
    "descriptionEn": "It is a website to help the hospital take care of the health of patients who are already on the hospital’s database, follow up on their medical records, provide medical advice to them, and direct them in the event of noticing any health risk by nominating specialized doctors, and analyses to ensure their safety. And helping site users to reassure themselves if they notice any strange symptoms by diagnosing some of the most common and dangerous diseases through artificial intelligence.",
    "technologies": "Backend: Java, Spring Boot, Maven, Frontend: TypeScript, React, Node.js, Machine Learning: Python, Scikit-learn, Databases: SQL and MongoDB, DevOps: Docker, Docker Compose, Spring Cloud",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/project%20graduation-1_%D8%A7%D8%B3%D9%84%D8%A7%D9%85%20%D9%85%D8%AD%D9%85%D9%88%D8%AF%20%D9%85%D8%AD%D9%85%D9%88%D8%AF%20%D9%85%D8%AD.pdf"
  },
  {
    "id": "27",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "نظام مركز الاتصالات للطلاب والأكاديميين",
    "projectTitleEn": "Student & Academic Call Center System",
    "supervisorAr": "د/ نوال الفيشاوى",
    "supervisorEn": "Dr. / Nawal El-Fishawy",
    "teamMembers": "اسلام ناصر عبدالظاهر: تثبيت وتهيئة نظام Issabel و Asterisk, احمد ناصر عبداللطيف: تخصيص تسجيلات قوائم IVR",
    "descriptionAr": "يهدف هذا المشروع إلى إنشاء نظام مركز اتصالات يعتمد على تقنية VoIP باستخدام نظام Issabel لتسهيل التواصل بين الطلاب وأعضاء هيئة التدريس والإدارات الإدارية داخل الجامعة. يوفر النظام قوائم صوتية تفاعلية باللغتين العربية والإنجليزية تُمكن المستخدم من الوصول إلى الخدمات الأكاديمية، ومعلومات التسجيل، والجداول الدراسية، وطرق التواصل مع الأقسام، وإجراءات الكشف الطبي، وغيرها، من خلال منصة اتصال موحدة.",
    "descriptionEn": "This project aims to build a VoIP-based call center system using Issabel to streamline communication between students, academic staff, and administrative departments within a university. The system offers interactive voice menus in Arabic and English, allowing users to access academic services, registration details, schedules, department contacts, medical examination procedures, and more—all through one unified communication platform.",
    "technologies": "Issabel, Asterisk, Linux, IVR (Interactive Voice Response), SIP Protocol",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BDDE1E899-A9DF-4F91-98AC-DD9C0CF2BD93%7D&file=project%20outline_%D8%A7%D8%B3%D9%84%D8%A7%D9%85%20%D9%86%D8%A7%D8%B5%D8%B1%20%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D8%B8%D8%A7%D9%87%D8%B1.docx&action=default&mobileredirect=true"
  },
  {
    "id": "28",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/—Pngtree—global data security personal data_1752646.jpg",

    "projectTitleAr": "سيبر لاب : بيئة تدريب عملية في مجال الأمن السيبراني",
    "projectTitleEn": "Cyber Lab: Hands-on Training Environment for Cybersecurity",
    "supervisorAr": "د/ مروه شرف الدين",
    "supervisorEn": "Dr.Marwa Sharaf Eldin",
    "teamMembers": "ابراهيم محمد ابراهيم نصار: Cybersecurity, احمد ابراهيم السيد رضوان: Cybersecurity, محمد عماد حسين الغنيمي: Cybersecurity, احمد جمال علي شريف: Frontend, ابراهيم جمال محمد ضلع: Frontend, احمد حسين السيد عبدالحميد: Fullstack, مؤمن مصطفى محمود سالم جاب الله: Backend",
    "descriptionAr": "المشروع يهدف إلى توفير بيئة تدريبية متكاملة في مجال الأمن السيبراني، تشمل شرحًا نظريًا مبسطًا للمتدرب حول كل موضوع، يتبعه لابات عملية تفاعلية تساعده على التطبيق العملي واكتساب المهارات بشكل فعّال.",
    "descriptionEn": "The project aims to provide a comprehensive training environment in cybersecurity, including simplified theoretical explanations for trainees, followed by hands-on interactive labs that help them apply the concepts and develop practical skills effectively.",
    "technologies": "Node.js: Used for developing the backend of the application. It provides a scalable, efficient, and event-driven runtime environment for handling server-side logic and APIs. React: Utilized for building the frontend interface. React offers a dynamic and responsive user experience through its component-based architecture and efficient rendering system. Docker: Employed for containerization of the application. Docker ensures consistent development and deployment environments, simplifies configuration, and enhances scalability by packaging the application and its dependencies into containers.",
    "category": "security",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BD6AE9437-A8F2-42AC-A805-58331B8FF1CD%7D&file=cyber%20lab_%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%D9%8A%D9%85%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%D9%8A%D9%85.docx&action=default&mobileredirect=true"
  },
  {
    "id": "29",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "منصة التعليم الذكي – ليرن هب",
    "projectTitleEn": "Smart Learning Platform – LearnHub",
    "supervisorAr": "د. زياد محمد الصغير طه عبدون",
    "supervisorEn": "Dr /Zeiad Mohamed El Saghir Taha Abdoun",
    "teamMembers": "محمد عادل عرفه: Back-End Developer using .NET, محمد صبري رجب: Full Stack Developer (Back-End using .NET, Front-End using Angular), محمد سعيد أبو العينين: Back-End Developer using .NET, محمد سالم غنام: Back-End Developer using .NET, إبراهيم سامي هندي: Front-End Developer using Angular, صبري رضوان: Front-End Developer using Angular",
    "descriptionAr": "“ليرن هب” هي منصة تعليم ذكية تتيح للطلاب الوصول إلى محتوى تعليمي متنوع عبر واجهة سهلة الاستخدام وتفاعلية. تتضمن المنصة الميزات التالية: نظام تسجيل دخول وإدارة حسابات – إدارة حسابات الطلاب والمدربين بشكل آمن ومنظم. تحميل ومتابعة الكورسات – إمكانية رفع المواد التعليمية للمدربين وتصفحها للطلاب. تتبع تقدم المتعلم – عرض نسبة إنجاز الدورات والاختبارات لكل طالب. اختبارات وشهادات – إجراء اختبارات إلكترونية وحصول الطالب على شهادة عند اجتياز الدورة. نظام توصيات ذكي – اقتراح محتوى مناسب لكل طالب بناءً على مستواه واهتماماته.",
    "descriptionEn": "\"Learn Hub\" is a smart educational platform that allows students to access a variety of educational content through an easy-to-use and interactive interface. The platform includes the following features:\n\n1. **Account Registration and Management System**: Secure and organized management of student and instructor accounts.\n\n2. **Course Upload and Tracking**: Instructors can upload educational materials, and students can browse them.\n\n3. **Learner Progress Tracking**: Displays the completion rate of courses and tests for each student.\n\n4. **Exams and Certificates**: Students can take online exams and receive certificates upon course completion.\n\n5. **Smart Recommendation System**: Suggests suitable content for each student based on their level and interests.",
    "technologies": "Front-End: Angular, Back-End: ASP.NET Core, Database: SQL Server",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B90FC492F-C1B4-47E6-8515-885DB0912BF3%7D&file=%D8%A8%D9%8A%D8%A7%D9%86%D8%A7%D8%AA%20%D8%A7%D9%84%D9%85%D8%B4%D8%B1%D9%88%D8%B9_%D8%AF.%20%D8%B2%D9%8A%D8%A7%D8%AF%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%A7%D9%84%D8%B5%D8%BA%D9%8A%D8%B1.docx&action=default&mobileredirect=true"
  },

  {
    "id": "30",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/net.png",

    "projectTitleAr": "بنيه تحتيه لشبكه شركه",
    "projectTitleEn": "Smart Infrastructure for Business Expansion",
    "supervisorAr": "د/ مها طلبة",
    "supervisorEn": "Dr./ Maha Tolba",
    "teamMembers": "مصطفى أحمد علام: Network design, wireless, and Documentation and Presentation format, البشير محمد توفيق: VPN Configuration, WAN Technology and NAT, private ip and public ip, منير موريس نبيه: Network security, Core switch configuration, Access switch configuration, نيرة جلال سلامة: DMZ and ASA Firewall configurations",
    "descriptionAr": "يتعلق المشروع بشركة تقنية حديثة تقدم حلولًا مخصصة على مستوى عالمي باستخدام أدوات متطورة وفريق عمل متخصص. وتركز على الابتكار والمرونة وتلبية احتياجات العملاء لدعم كفاءة ونمو الأعمال. ونظرًا للتوسع، تنتقل الشركة إلى مبنى جديد متعدد الطوابق يضم أقسامًا رئيسية مثل المبيعات، والموارد البشرية، والمالية، وتقنية المعلومات والاتصالات. تدعم هذه الهيكلية التوسع المستقبلي، بما في ذلك إمكانية إضافة أجهزة أو فروع جديدة، مع وجود موقعين رئيسيين: المقر الرئيسي والفرع الثانوي.",
    "descriptionEn": "The project involves a modern tech company that delivers global, customized technology solutions through advanced tools and expert teams. Focused on innovation, agility, and customer needs, it helps businesses improve efficiency and growth. Due to expansion, the company is moving to a new multi-floor facility housing key departments like Sales, HR, Finance, and ICT. The structure supports scalability for future growth, including the ability to add more devices or branches, with two main sites: the Headquarters and a secondary branch.",
    "technologies": "Virtual LANs (VLANs) & inter VLANs, LAN Security methods, Firewall ASA, VPN, LACP, HSRP, Wireless, Access lists (ACLs)",
    "category": "networks",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BE7E50FB7-F94B-4406-B8C0-1B27357CE4B0%7D&file=4_6007941231651329word_%D9%86%D9%8A%D8%B1%D9%87%20%D8%AC%D9%84%D8%A7%D9%84%20%D8%B3%D9%84%D8%A7%D9%85%D9%87%20%D8%A7%D9%84%D8%B3%D9%8A.docx&action=default&mobileredirect=true"
  },
  {
    "id": "31",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "منصة لمختبري الاختراق للتدرب على العثور على الثغرات الأمنية",
    "projectTitleEn": "A platform for pentesters to practice  finding vulnerabilities",
    "supervisorAr": "دكتور الحسينى خطاب",
    "supervisorEn": "Dr. Al-Husseini Khattab",
    "teamMembers": "مفدى ماجد عبد الحكيم يعقوب: Cyber-security, محمد محمود حسن خليل: Cyber-security, عبدالمنعم خالد عبدالمنعم السبكي: Back end, أسماء دياب عبد السميع راغب: Back end, ندى طارق جلال أبو دراع: Front end, ليلى حمدان مسعد عبدالله: Front end",
    "descriptionAr": "منصة ويب تفاعلية تهدف إلى تدريب مختبري الاختراق (Pentesters) على اكتشاف الثغرات الأمنية واختبار أمان التطبيقات في بيئة افتراضية معزولة وآمنة. تتيح المنصة للمستخدمين اختيار معامل تعليمية (Labs) تحتوي على ثغرات مقصودة، مع إمكانية تتبع التقدم وتحديث بيانات الحساب. وتُعزز المنصة تجربة المستخدم من خلال شات بوت ذكي قادر على الرد على استفساراتهم الفنية وتوجيههم داخل المعامل. تم تطوير المنصة باستخدام .NET وتقنيات حديثة لضمان بيئة تعليمية واقعية وآمنة.",
    "descriptionEn": "An interactive web-based training platform designed for penetration testers. It provides isolated lab environments containing deliberately vulnerable code, allowing users to safely practice identifying and exploiting security flaws. The platform includes features for profile management, progress tracking, and secure authentication. Additionally, it integrates an intelligent chatbot that assists users by answering their technical questions and guiding them through the labs. Developed with modern technologies including .NET Core, SQL Server, and Docker, it offers a realistic and secure hands-on learning experience.",
    "technologies": "HTML5, CSS3, Vanilla JS, Bootstrap5, SASS, Dialogflow Messenger, Open AI, Micro service, Micro-Frontends, Fontawsome, Session storage, Responsive design, C#, ASP.NET Core 8, Entity framework, SQL Server, ASP.NET Core Identity, JWT, Mysql (mariadb), Linq, PHP, Clean Architecture Pattern, Docker, Laravel",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B1A2E920A-A544-4044-BCA5-745687364916%7D&file=%D9%85%D8%AA%D8%B7%D9%84%D8%A8%20%D9%85%D9%86%D8%A7%D9%82%D8%B4%D8%A9%20%D8%A7%D9%84%D8%AA%D8%AE%D8%B1%D8%AC_%D8%A7%D8%B3%D9%85%D8%A7%D8%A1%20%D8%AF%D9%8A%D8%A7%D8%A8%20%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D8%B3%D9%85%D9%8A%D8%B9.docx&action=default&mobileredirect=true"
  },
  {
    "id": "32",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": " نظام مساعد ذكي للمكفوفين باستخدام الذكاء الاصطناعي",
    "projectTitleEn": "AI-Powered Assistance System for the Visually Impaired",
    "supervisorAr": "د.مها طلبة",
    "supervisorEn": "D. Maha Tolba",
    "teamMembers": "احمد فتح الباب احمد محمد: AI & computer vision, احمد محمد عبدالعليم عمر: AI & flutter",
    "descriptionAr": "يهدف هذا المشروع إلى تطوير نظام ذكي يعتمد على الرؤية الحاسوبية لمساعدة المكفوفين وضعاف البصر على التنقل بشكل مستقل وآمن. يدمج النظام تقنيات مثل التعرف على الأجسام في الوقت الحقيقي، تقدير المسافات للعوائق، واجهة أوامر صوتية، وقراءة النصوص من الصور (OCR). يعمل النظام كـ \"عين\" للمستخدم، حيث يحدد الأشياء المحيطة، يقرأ اللافتات والإعلانات بصوت مسموع، ويوجهه باستخدام أوامر صوتية.",
    "descriptionEn": "This project aims to develop a smart vision-based assistance system that helps blind and visually impaired individuals navigate their surroundings independently and safely. The system integrates real-time object detection, obstacle distance estimation, a voice command interface, and OCR for reading texts. It acts as the user's \"eyes\" by identifying nearby objects, reading signs or advertisements aloud, and guiding the user through spoken instructions.",
    "technologies": "YOLOv8, Tensorflow, Paddle OCR, OpenCV, ImageDataGenerator, Depth Estimation, SUN RGB-D dataset, Cityscapes dataset, SpeechRecognition, pyttsx3, gTTS, Microphone and Speaker, Flutter",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B3F6D611F-BD3D-4A48-A34F-B6F9BE95F9FC%7D&file=Vision%20blind_%D8%A7%D8%AD%D9%85%D8%AF%20%D9%85%D8%AD%D9%85%D8%AF%20%D8%B9%D8%A8%D8%AF%20%D8%A7%D9%84%D8%B9%D9%84%D9%8A%D9%85.docx&action=default&mobileredirect=true"
  },
  {
    "id": "33",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "النمو القائم على البيانات: رحلة تحليلات المبيعات",
    "projectTitleEn": "Data-Driven Growth: A Sales Analytics Journey",
    "supervisorAr": "د/ مروة شرف الدين",
    "supervisorEn": "Dr/ Marwa Sharf-eldin",
    "teamMembers": "عبدالفتاح جمال عبدالفتاح محمود: Team Leader, سيد إسماعيل سيد: Data Warehouse Developer, السيد سعيد السيد: Customer & Sales Analyst, فايز عبدالمقصود السيد: Market Basket & Profitability Analyst",
    "descriptionAr": "هدفنا اننا نساعد البيزنس من نوع B2C والشركات الناشئة من خلال اننا بنجمع الداتا كلها على مستوى الشركة ونحللها ونخرنها على داتا بيز، وبنظهر داشبورد من الداتا لأصحاب الإدارات في الشركات فيقدروا ياخدوا قرارات صحيحة ويكبروا البيزنس.",
    "descriptionEn": "This project empowers B2C businesses and startups to make smarter decisions through data-driven strategies. We designed an end-to-end pipeline that collects, stores, and analyzes organizational data from both CRM and ERP systems. By integrating this data into a centralized data warehouse, we perform in-depth customer segmentation, sales performance analysis, and product profitability evaluation. The outcomes are presented via interactive dashboards tailored for business leadership—enabling strategic growth based on real insights.",
    "technologies": "Microsoft SQL Server, SQL, Data Warehouse concepts, GitHub",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B8B3F4D57-11E1-4F0E-B12B-214AAF57695E%7D&file=GP_AbdAlfatah%20Gamal.docx&action=default&mobileredirect=true"
  },
  {
    "id": "34",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/ai.png",

    "projectTitleAr": " دكتور كير",
    "projectTitleEn": "Dr.Care: An AI-Powered Dental Analysis Platform",
    "supervisorAr": " دكتور: أيمن السيد عميره ",
    "supervisorEn": "Prof. Dr. Ayman El-Sayed Omera",
    "teamMembers": "يوسف مسكه: Backend, عبدالله زهره: Backend, محمد حلمى: AI, عمر مختار: AI, هاجر عطيه: Frontend, رؤى رضا: Frontend",
    "descriptionAr": "هو نظام ذكي للكشف المبكر عن مشاكل الأسنان باستخدام الذكاء الاصطناعي. يتيح للمستخدم رفع ثلاث صور لأسنانه (أمامية، علوية، جانبية)، ليتم تحليلها باستخدام نموذج YOLO لاكتشاف التسوس والمشاكل الشائعة. بعد ذلك، يتم توليد تقرير طبي مبسط باستخدام نموذج لغوي كبير (LLM) مدعوم بـ Function Calling لضمان دقة التفسير، ويُعرض للمستخدم بشكل ثنائي اللغة (عربي وإنجليزي) من خلال واجهة استخدام تفاعلية مبنية بـ Next.js. المشروع يجمع بين الرؤية الحاسوبية، والذكاء التوليدي، والتكامل بين الواجهة الأمامية والخلفية لتحقيق تجربة طبية ذكية وسريعة.",
    "descriptionEn": "\"Dr.Care\" is an AI-powered dental assistant designed to help users detect dental issues early. The user uploads three dental images (frontal, upper, and side views), which are analyzed by a YOLO object detection model to identify conditions like cavities and misalignment. The detection results are then interpreted using a Large Language Model (LLM), enhanced by Function Calling for accurate and structured understanding. The system generates a bilingual (Arabic/English) medical-style report and displays it through a user-friendly interface built with Next.js. The project combines computer vision, generative AI, and full-stack integration to deliver a smart and responsive dental diagnosis experience.",
    "technologies": "NestJS, Redis, BullMQ, AWS S3, Multer, Sharp, YOLOv8 (Ultralytics), OpenAI GPT-4, Function Calling, Python, FastAPI (optional), Next.js (React), Tailwind CSS, Styled Components, Axios, Fetch API, Postman, Git, GitHub, Google Colab, Jupyter, Figma",
    "category": "ai",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B476BD950-09C7-4B5C-9B7F-F321BF159221%7D&file=Dr.Care_OMAR%20MOKHTAR.docx&action=default&mobileredirect=true"
  },
  {
    "id": "35",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "خيط نجاه",
    "projectTitleEn": "Life Line",
    "supervisorAr": " د / مها طلبه",
    "supervisorEn": "Dr. / Maha Tolba",
    "teamMembers": "Youssif Mohamed Youssif Aamer: Back-end Developer, Nesma Mostafa: Frontend Design Developer, Haidy Ahmed Nabawy Zahran: Frontend Angular Developer, Karim Maher Abdelrahim Abdelaty: Back-end Developer",
    "descriptionAr": "إحنا شغالين على مشروع ويب أبليكيشن فكرته إنه يكون منصة بتجمع بين الناس اللي حابة تتبرع بالدم، وبين الناس اللي محتاجة الدم. اللي حابب يتبرع هيقدر يعمل بوست يكتب فيه فصيلة دمه، ومكانه، والمستشفيات أو بنوك الدم اللي يقدر يروح يتبرع فيها، وساعتها أي حد محتاج ممكن يدخل على البوست ده ويتواصل معاه، ويتفقوا على المكان والوقت اللي هيتقابلوا فيه، عشان تتم عملية التبرع. وفي كمان بوست طوارئ مثبت بيكون موجود طول الوقت، بيتحدث حسب الحاجة، وده مخصص للحالات العاجلة، زي الحوادث أو الحالات الحرجة اللي بتحتاج متبرعين في أسرع وقت. كمان في النظام فيه صفحات حسب نوع المستخدم، يعني في صفحة للمستخدم العادي يقدر من خلالها ينشر بوستات ويتواصل مع الناس، وفي لوحة تحكم كاملة للأدمن، بيقدر من خلالها يراقب كل حاجة بتحصل، ويمسح أي بوست مسيء أو مش مناسب، عشان يضمن إن كل حاجة ماشية بشكل محترم ومنظم.",
    "descriptionEn": "We are working on a web application project that aims to create a platform for blood donors to help people who are in need of blood. Donors will be able to create posts where they can share information such as their blood type, location, and the hospitals or blood banks they are willing to go to for donation. Through the post, a person who needs blood can contact the donor, and they can agree on the time and place to meet and complete the blood donation. There will also be a pinned emergency post that appears at the top of the platform. This is for urgent situations like accidents or major cases where immediate help is needed, allowing any nearby donor to respond quickly. The system will have different pages for users: • A regular user page for donors and recipients to create posts and communicate. • A full admin panel, where the admin can manage the platform. The admin will be able to delete inappropriate posts and act as a moderator, making sure everything is running smoothly and respectfully.",
    "technologies": "ASP.NET Core, SQL Server, Angular, HTML, CSS, TypeScript",

    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B669FED3F-128A-4783-82D5-9000E836263C%7D&file=life%20line%20web%C2%A0app_YOUSSEF%20mohamed.docx&action=default&mobileredirect=true"
  },
  {
    "id": "36",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "تصميم وتنفيذ نظام شبكة الشركة الآمنة",
    "projectTitleEn": "Design and Implementation of a secure company network system",
    "supervisorAr": " د / مها طلبه",
    "supervisorEn": "Dr. / Maha Tolba",
    "teamMembers": "Aya Ali: Primary Branch Implementation, Shimaa Saied: Secondary Branch Implementation, Marwa Nabil: Remote site and DMZ Implementation, Ayman Sabry: FortiGate Firewall Implementation",
    "descriptionAr": "يركز المشروع على تأمين شبكات الحاسوب من التهديدات الداخلية والخارجية والوصول غير المصرح به. يقدم المشروع تصميمًا آمنًا وقابلًا للتطوير لشبكة منظمة ذات فرعين (رئيسي وثانوي)، بالإضافة إلى شبكة منزوعة السلاح (DMZ) وشبكة وصول عن بعد.",
    "descriptionEn": "Project focuses on securing computer networks from internal and external threats and from unauthorized access. Project presents a secure and scalable network design for an organization with two branches (Primary and Secondary), DMZ and Remote Access Network.",
    "technologies": "PNETLab, Virtual Machine, FortiGate Firewall, Servers, Core & Access Switches, Router",

    "category": "security",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Network_Project_%D9%85%D8%B1%D9%88%D8%A9%20%D9%86%D8%A8%D9%8A%D9%84%20%D8%B3%D9%84%D9%8A%D9%85%D8%A7%D9%86%20%D8%B9%D9%85%D8%B1.pdf"
  },
  {
    "id": "37",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "منصة مقابلات وتواصل اجتماعي",
    "projectTitleEn": "Code Meet",
    "supervisorAr": "أ.د / نرمين البهنساوي",
    "supervisorEn": "Prof. Dr. Nirmeen A. El-Bahnasawy ",
    "teamMembers": "عبد الرحمن عماد سعيد الشيخ: Backend + Frontend, أحمد إبراهيم حلمي عبد الدايم منتصر: Frontend, مصطفى طارق محمد حسن السيد: Backend + Frontend, مصطفى حسين عبد الحليم عبد الغني: Backend",
    "descriptionAr": "يندرج مشروع Code Meet تحت تصنيف مشاريع الـRealtime Systems، حيث يوفر المشروع مجموعة من المميزات التي تسمح للمستخدمين بالتواصل والتفاعل مع بعضهم البعض في الوقت الفعلي دون الحاجة للانتظار أو إعادة تحميل الموقع. يساعد Code Meet بشكل خاص المبرمجين والمعلمين على استخدام محرر أكواد للعديد من اللغات سواء بشكل فعلي داخل لقاء (Meeting) أو بشكل مستقل خارجه.\n\nالمميزات:\n• إمكانية تكوين صداقات ومحادثات خاصة بين فردين.\n• إمكانية تكوين محادثات عامة (مجموعات) للعديد من الأفراد.\n• نظام تنبيهات فعلي (Realtime notifications) للأحداث.\n• إمكانية استخدام محرر أكواد على الموقع، وتشغيل هذه الأكواد للعديد من اللغات.\n• إمكانية عمل لقاءات (Meetings) فعلية والتواصل مع الأعضاء المشاركين عن طريق الصوت، الكاميرا، الرسائل النصية، أو محرر الأكواد الفعلي (Realtime Code Editor).",
    "descriptionEn": "Code Meet is a combination of a real-time, collaborative meeting platform and social media platform. It merges voice meetings, live coding, chat, and social interaction in one unified space designed to simulate an engaging, interactive, and professional environment for technical collaboration.\n\nFeatures:\n• The ability to make friendships\n• Enable Flexible Communication\n• Real-time chatting between user peers as well as room (Groups) chatting.\n• Smart notification system alerts users of key activities keeping them engaged and in sync.\n• Integrated code editor with syntax highlighting, execution capabilities, and host-controlled contribution (public/private modes with contributor approval).\n• Realtime meetings with voice, camera, chat, or even with the realtime code editor.",
    "technologies": "Java 17, Spring Boot, Maven, Spring Web, Hibernate/Spring Data JPA, Spring WebSocket, Spring Security, STOMP, MySQL, TypeScript, Angular, Tailwind CSS, CodeMirror 6, Agora RTC SDK, Agora RTM, STOMP over WebSocket, RxJS, Docker, Git/GitHub, Cloudflare Tunnel",

    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/Documents/Apps/Microsoft%20Forms/Graduation%20Projects%20Details%20-%20CSE%20Department,%20FEE/Question/Graduation%20Projects%20Details_AbdAlrahaman%20EMAD.pdf"
  },
  {
    "id": "38",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "نظام ادارة شئون اعضاء هيئة التدريس بجامعة المنوفية. ",
    "projectTitleEn": "Staff's Affairs Management System for Menoufia University ",
    "supervisorAr": "د /جمال سليم",
    "supervisorEn": "Dr. Gamal Selim ",
    "teamMembers": "ابراهيم جابر ابراهيم عبده - Backend Developer (Receive feature requirements, Design database changes, Create EF Core entities and migrations, Implement repository/service layer methods, Add DTOs, Create controller endpoints for Staff Member Info and Staff Job Info), صالح محمد نجيب صالح - Backend Developer (Receive feature requirements, Design database changes, Create EF Core entities and migrations, Implement repository/service layer methods, Add DTOs, Create controller endpoints for Staff Qualification, Staff Vacation, Staff Punishment, Staff Course, Staff Certificates of Appreciation, Staff Relations, Staff Degrees), رانيا محمد عبداللطيف سعد - Backend Developer (Receive feature requirements, Design database changes, Create EF Core entities and migrations, Implement repository/service layer methods, Add DTOs, Create controller endpoints for University Faculty Job, Job Type, Entedab Type, Nationality, Military State, Social State, Work Status), يوسف اشرف محمود خواجة - DevOps Engineer (Deployed staff affairs web app, configured IIS, installed/managing SQL Server, testing/troubleshooting, maintenance), عماد الدين عادل محمود رزق - DevOps Engineer (Same duties as يوسف اشرف محمود خواجة), احمد علي الدحدوح - DevOps Engineer (Same duties as above), نورهان سمير الشرقاوي - Software Tester (API testing, manual testing for all pages), اسراء ابراهيم احمد ابراهيم سليمان - Front-End Developer (React UI/UX design, Redux Toolkit state management, form validation, multi-browser testing for University Faculty Job, Job Type, Entedab Type, Nationality, Military State, Social State, Work Status), عمر عبد العزيز محمود التراس - Front-End Developer (React UI/UX, API consumption, error handling, performance optimization for Staff Member Info, Staff Job Info), محمد احمد عطية عثمان - Front-End Developer",
    "descriptionAr": "نظام إدارة شؤون أعضاء هيئة التدريس بجامعة المنوفية يتيح تسجيل وحفظ بيانات أعضاء هيئة التدريس والهيئة المعاونة مركزياً: البيانات الشخصية، الوظيفية (الإشرافية، العلمية، الحالية، الانتداب)، المؤهلات العلمية، الدرجات العلمية، سجل الإجازات، التأديبات والجزاءات، مع إمكانية استخراج تقارير ملفات الأعضاء وتقارير إحصائية.",
    "descriptionEn": "The Faculty Affairs Management System at Menoufia University enables centralized registration and record maintenance for faculty and supporting staff including personal details, job positions (supervisory, academic, current, secondment), academic qualifications, degrees, vacation history, disciplinary actions, and supports generating member profile and statistical reports.",
    "technologies": "Backend: C# (Primary), ASP.NET Web API with .NET8, RESTful API, Swagger, AutoMapper, EF Core, LINQ, ASP.NET Core Identity, SQL Server; Frontend: React, Redux Toolkit, Material-UI, Emotion, MUI Data Grid, Formik & Yup, React Router, SweetAlert2, React Testing Library, Web Vitals, React Scripts; DevOps: Windows Server, IIS, Microsoft SQL Server, RDP, Firewall & Security Settings; Security: Burp Suite, OWASP ZAP, Nmap; Testing: Postman, Swagger",

    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7BC5AE1D5D-E922-44E0-8967-E0EA9969E96A%7D&file=Staff%27s%20Affairs%20Management%20System%20for%20Menoufi_%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%D9%8A%D9%85%20%D8%AC%D8%A7%D8%A8%D8%B1%20%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%D9%8A%D9%85.docx&action=default&mobileredirect=true"
  },
  {
    "id": "39",
    "startTime": "2025-07-05 22:34:26",
    "completionTime": "2025-07-05 23:07:58",
    "imageUrl": "/soft.png",

    "projectTitleAr": "سبليتفاي  ",
    "projectTitleEn": "Splitify  ",
    "supervisorAr": "أ.د / نرمين البهنساوي",
    "supervisorEn": "Prof. Dr. Nirmeen A. El-Bahnasawy ",
    "teamMembers": "• Reem Ibrahim Abdullah Abdel-Ghani Nassif - Backend Developer & Project Manager (Node.js, APIs, Database Management & Project Coordination) • Rowan Salah El-Din El-Sayed Abdel-Aal Farag - Backend Developer (Socket.IO, Authentication, Commission System & Real-time Features) • Rowan Mohamed Shaaban El-Sayed Shaheen - Frontend Developer (Angular Components, User Interfaces & Dashboard Development) • Eman Galal Fahmy Mohamed Shabl - Frontend Developer (UI/UX Design, Website Creation Module & Client-side Functionality)",

    "descriptionAr": "يُعد مشروع \"سبليتفاي\" نظاماً متطوراً ومتكاملاً للتسويق بالعمولة يهدف إلى إحداث نقلة في صناعة التجارة الإلكترونية من خلال توفير منصة شاملة تربط بين التجار والمسوقين بطريقة مبتكرة وفعالة. يتميز النظام بهيكل عمولات متدرج يضمن العدالة والشفافية في توزيع الأرباح على جميع المشاركين في السلسلة التسويقية. الهيكل التنظيمي والأدوار المتخصصة يعمل النظام من خلال أربعة أدوار محورية مترابطة: المدير العام (System Administrator): • إدارة البيانات الأساسية للنظام (الفئات، المقاسات، الألوان، المناطق الجغرافية) • إنشاء وإدارة حسابات التجار وقادة الفرق • مراجعة واعتماد المنتجات المُرسلة من التجار • تحديد هوامش الربح وإستراتيجيات التسعير • إدارة النظام المالي وعمليات التحويل التاجر (Merchant): • عرض وإدارة كتالوج المنتجات الخاص به • تحديد الأسعار الأساسية والمواصفات التقنية • رفع الصور ومقاطع الفيديو التوضيحية • متابعة مبيعات منتجاته وأرباحه قائد الفريق (Team Leader): • إنشاء وتخصيص المواقع الإلكترونية التسويقية الشخصية • اختيار المنتجات المناسبة لجمهوره المستهدف • إدارة فريق مندوبي المبيعات مندوب المبيعات (Sales Representative): • تصفح واختيار المنتجات من مواقع قادة الفرق • معالجة طلبات العملاء وإدخال البيانات • متابعة عمليات الشحن والتوصيل سير العمل التفصيلي مرحلة التأسيس والإعداد: يبدأ النظام بقيام المدير بإعداد البنية التحتية للبيانات، حيث يُدخل جميع التصنيفات الرئيسية للمنتجات، المقاسات المتاحة، الألوان، والمناطق الجغرافية للتوصيل. كما يقوم بإنشاء الحسابات الأولية للتجار وقادة الفرق مع تحديد صلاحيات الوصول لكل دور. مرحلة عرض المنتجات والاعتماد: عندما يقوم التجار بتسجيل الدخول، يعرضون منتجاتهم من خلال اختيار التصنيفات المناسبة والمواصفات التقنية، ثم يضعون السعر الأساسي الذي يرونه مناسباً مع رفع مواد تسويقية عالية الجودة. يراجع المدير هذه المنتجات بدقة، مع إمكانية تعديل الأوصاف والصور لضمان الجودة، ثم يضيف هامش ربحه الخاص ويغير حالة المنتج لجعله متاحاً لقادة الفرق. مرحلة إنشاء المواقع التسويقية: يدخل قادة الفرق لإنشاء مواقعهم الإلكترونية المتخصصة، حيث يخصصون تماماً صفحة التسجيل، المحتوى الرئيسي. يسهل النظام إنشاء مواقع احترافية بناءً على هذه المعطيات، مما يوفر لكل قائد فريق منصة تسويقية. مرحلة التسويق والمبيعات: يتصفح مندوبو المبيعات المنتجات على مواقع قادة الفرق، ويختارون المنتجات المناسبة. عند استقبال طلب من عميل، يدخلون جميع التفاصيل المطلوبة، بما في ذلك معلومات العميل، عنوان التوصيل، والسعر النهائي المحدد حسب هامش ربحهم. يتم معالجة الطلب تلقائياً وإرساله للشحن. آلية حساب وتوزيع العمولات المفصلة نظام التسعير التدريجي والعمولات: يعتمد نظام سبليتفاي على آلية تسعير تدريجية مرنة تتيح لكل مشارك في السلسلة التسويقية حرية كاملة في تحديد هامش ربحه وعمولته حسب إستراتيجيته الخاصة وظروف السوق. مراحل تحديد الأسعار والعمولات: المرحلة الأولى - التاجر (Merchant): • يضع التاجر السعر الأساسي للمنتج = X (حسب تقديره الشخصي) • يحصل التاجر على كامل المبلغ X كإيراد من بيع منتجه المرحلة الثانية - المدير (Administrator): • يراجع المدير المنتج ويوافق عليه • يضيف المدير هامش ربحه = أي مبلغ يحدده (ليس مقيداً برقم معين) • السعر الجديد للمنتج = X + هامش ربح المدير المرحلة الثالثة - قائد الفريق (Team Leader): • يختار قائد الفريق المنتجات المناسبة لجمهوره • يضيف هامش ربحه = أي مبلغ يراه مناسباً لإستراتيجيته • السعر الجديد = سعر المدير + هامش ربح قائد الفريق المرحلة الرابعة - مندوب المبيعات (Sales Representative): • يختار مندوب المبيعات المنتجات من موقع قائد الفريق • يضيف هامش ربحه = أي مبلغ يحدده بناءً على جهوده التسويقية • السعر النهائي للعميل = سعر قائد الفريق + هامش ربح مندوب المبيعات الميزات التقنية المتقدمة نظام المحادثة الفورية (Live Chat System): مُطبق باستخدام تقنية Socket.IO المتطورة، يوفر تواصلاً مباشراً ولحظياً بين مندوبي المبيعات والإدارة. هذا النظام يضمن حل المشاكل فوراً، الإجابة على الاستفسارات، وتقديم الدعم التقني المطلوب في الوقت الفعلي. نظام الفاتورة السريعة (Quick Invoice System): ميزة ثورية تسمح بإنشاء الفواتير في ثوانٍ معدودة من خلال قوائم منسدلة تفاعلية. يختار مندوب المبيعات المنتجات بنقرات بسيطة، مما يقلل الوقت المطلوب لمعالجة الطلبات من دقائق إلى ثوانٍ. نظام طلب المنتجات غير المتاحة (Special Product Requests): عندما يطلب العملاء منتجات غير متوفرة حالياً، يمكن لمندوبي المبيعات إرسال طلبات خاصة للإدارة. يراجع المدير هذه الطلبات.",

    "descriptionEn": "# Splitfy System - Comprehensive Affiliate Marketing Platform Splitfy is an advanced affiliate marketing system designed to revolutionize e-commerce by connecting merchants and marketers through a tiered commission structure that ensures transparent profit distribution among all participants. System Architecture and Roles The platform operates through four interconnected roles: System Administrator manages fundamental system data including product categories, sizes, colors, and geographical regions. They create merchant and team leader accounts, review and approve products, determine profit margins and pricing strategies, and oversee the financial system including transfer operations. Merchants serve as product suppliers, managing comprehensive product catalogs. They set base prices and technical specifications, upload high-quality images and videos, and monitor sales performance and profit margins. Team Leaders act as marketing coordinators, creating customized personal marketing websites tailored to specific audiences. They select appropriate products for their target demographics and manage teams of sales representatives. Sales Representatives function as the customer interface, browsing products from team leaders' websites, processing customer orders with complete data entry, and handling shipping and delivery coordination. Operational Workflow The system begins with a setup phase where the administrator establishes data infrastructure by inputting product categories, sizes, colors, and delivery regions while creating accounts for merchants and team leaders with defined access permissions. During product display, merchants showcase their products by selecting categories and specifications, setting competitive base prices, and uploading marketing materials. The administrator reviews submissions, modifies descriptions and images for quality assurance, adds profit margins, and makes products available to team leaders. The marketing phase allows team leaders to build specialized websites with customized registration pages and content. The system facilitates professional website creation, providing each leader with a dedicated marketing platform. In the sales phase, representatives browse team leaders' websites and select appropriate products. When receiving orders, they enter customer information, delivery addresses, and final prices based on their profit margins. Orders are automatically processed and sent for shipping. Commission Structure Splitfy employs a flexible tiered pricing mechanism granting each participant complete freedom to determine profit margins according to their strategy and market conditions. The process flows as follows: merchants set initial base prices, administrators add their margins after product approval, team leaders add margins when selecting products for their audiences, and sales representatives add final margins based on marketing efforts, creating the ultimate customer price. Advanced Technical Features The platform incorporates cutting-edge technology including a live chat system using Socket.IO technology, providing instant communication between sales representatives and management for immediate problem resolution and real-time technical support. The quick invoice system allows invoice creation in seconds through interactive dropdown menus, enabling sales representatives to select products with simple clicks and dramatically reducing order processing time from minutes to seconds. The special product requests system enables representatives to send requests to management when customers seek unavailable products, ensuring comprehensive customer service and potential business expansion opportunities. This comprehensive system creates a seamless, efficient, and profitable environment for all participants in the affiliate marketing chain, combining innovative technology with flexible business models to maximize success.",

    "technologies": "Frontend Technologies: • Angular - Frontend framework for building the user interface • TypeScript - Programming language for Angular development • HTML5 & CSS3 - Markup and styling languages • Bootstrap/Angular Material - UI component library for responsive design Backend Technologies: • Node.js - Server-side JavaScript runtime environment • Express.js - Web application framework for Node.js • JavaScript/TypeScript - Programming languages for backend development Database: • PostgreSQL - Relational database management system • Sequelize - Object-Relational Mapping (ORM) library Real-time Communication: • Socket.IO - Real-time bidirectional event-based communication Authentication & Security: • JWT (JSON Web Tokens) - For user authentication and authorization • bcrypt - For password hashing and security • CORS - Cross-Origin Resource Sharing middleware Development Tools: • Git - Version control system • npm - Package manager • Postman - API testing and development tool • VS Code - Integrated Development Environment",
    "category": "software",
    "documentUrl": "https://elengmenofiaedu-my.sharepoint.com/personal/ah_he_kasas_el-eng_menofia_edu_eg/_layouts/15/Doc.aspx?sourcedoc=%7B3F15FC58-64F6-4B8E-A68B-75B6BDBAC284%7D&file=Splitify%20Graduation%20Project_%D8%B1%D9%8A%D9%85%20%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%D9%8A%D9%85%20%D8%B9%D8%A8%D8%AF%D8%A7%D9%84%D9%84%D9%87.docx&action=default&mobileredirect=true"
  }
]
